{"slug":"cyberark","name":"CyberArk Software","ticker":"CYBR","isPublic":true,"entityType":"company","ownership":"public","parentCompany":null,"parentSlug":null,"financials":{"revenue_2024":"$1.3B","market_cap":"$24B","revenue_raw":1300000000,"market_cap_raw":24000000000},"financialsByYear":{"2015":{"revenue":"$161M","revenue_raw":161000000,"market_cap":"$2B","market_cap_raw":2000000000},"2020":{"revenue":"$464M","revenue_raw":464000000,"market_cap":"$5B","market_cap_raw":5000000000},"2024":{"revenue":"$1B","revenue_raw":1000000000,"market_cap":"$15B","market_cap_raw":15000000000},"2025":{"revenue":"$1.3B","revenue_raw":1300000000,"market_cap":"$24B","market_cap_raw":24000000000}},"years":{"2005":{"query":"CyberArk competitors 2005 privileged access management","date":"2024-12-24","context":"CyberArk Software Ltd. is a identity security company focused on privileged access management, identity security, and secrets management. Pioneered privileged access security. Enterprise vault solutions.","sources":["https://en.wikipedia.org/wiki/CyberArk","https://www.researchandmarkets.com/report/privileged-access-management","https://golden.com/wiki/Thycotic-MNAPBEG","https://www.ibm.com/docs/en/spim/1.0.1.1?topic=overview-privileged-identity-management","https://docops.ca.com/ca-privileged-identity-management/12-8/en/reference/the-ca-controlminder-registry/accesscontrol"],"competitors":[{"name":"IBM Tivoli","notes":"Enterprise identity and access management suite including Tivoli Access Manager and Tivoli Identity Manager, offering privilege management capabilities for operating systems and applications across Unix, Linux, and Windows platforms"},{"name":"CA Technologies","notes":"Provided CA ControlMinder (later part of CA Privileged Access Manager) for host access control and privileged user management across physical and virtual environments, with capabilities for superuser delegation and access restriction"},{"name":"Thycotic","notes":"Released Secret Server in 2005, an enterprise password management software for IT admins, competing directly with CyberArk in the emerging privileged password management space"},{"name":"BeyondTrust (formerly Bomgar)","notes":"Founded in 1985, pioneered many early PAM capabilities with PowerBroker solutions, though initially focused more on remote access and systems management before expanding into comprehensive PAM"}]},"2010":{"query":"CyberArk competitors 2010 identity security PAM","date":"2024-12-24","context":"CyberArk Software Ltd. is a identity security company focused on privileged access management, identity security, and secrets management. Privileged account security essential after breaches.","sources":["https://en.wikipedia.org/wiki/CyberArk","https://delinea.com/centrify","https://golden.com/wiki/Thycotic-MNAPBEG","https://www.ibm.com/docs/en/spim/1.0.1.1?topic=overview-privileged-identity-management","https://www.beyondtrust.com/vs/cyberark-alternative","https://www.researchandmarkets.com/report/privileged-access-management"],"competitors":[{"name":"Thycotic","notes":"Growing rapidly with Secret Server as a comprehensive privileged account password management solution, offering password vaulting, automated rotation, session recording, and real-time threat analytics"},{"name":"Centrify","notes":"Offering DirectControl and the Centrify Suite for secure authentication, single sign-on, role-based access control, and privileged identity management across heterogeneous systems, with a focus on centralizing fragmented identities"},{"name":"IBM Tivoli","notes":"Providing comprehensive identity and access management through Tivoli Identity Manager and Tivoli Access Manager, with privileged identity management capabilities and role lifecycle management features"},{"name":"CA Technologies","notes":"Offering CA ControlMinder and CA Privileged Access Manager for host access control, privileged user management, and password maintenance across physical, virtual, and cloud environments"},{"name":"BeyondTrust","notes":"Delivering PowerBroker and privilege management solutions, pioneering many must-have PAM capabilities for controlling and tracking privileged access across enterprise environments"},{"name":"Quest Software (One Identity)","notes":"Providing identity and access management solutions with privileged access governance capabilities for enterprise environments"}]},"2015":{"query":"CyberArk competitors 2015 privileged access management market","date":"2024-12-24","context":"CyberArk Software Ltd. is a identity security company focused on privileged access management, identity security, and secrets management. IPO. Expanded beyond PAM to broader identity.","sources":["https://en.wikipedia.org/wiki/CyberArk","https://www.gartner.com/reviews/market/privileged-access-management","https://delinea.com/centrify","https://golden.com/wiki/Thycotic-MNAPBEG","https://www.silverfort.com/blog/leading-alternatives-to-cyberark/","https://www.beyondtrust.com/vs/cyberark-alternative"],"competitors":[{"name":"BeyondTrust","notes":"Major PAM leader offering Universal Privilege Management approach with solutions deployable as SaaS or on-premises, simplifying deployments while reducing privilege risks across all users, assets, and sessions"},{"name":"Thycotic","notes":"Rapidly growing PAM vendor with Secret Server as a flagship product, ranked number 436 in Deloitte's 2018 Technology Fast 500, offering easy-to-install privileged access management with cloud and on-premises deployment options"},{"name":"Centrify","notes":"Named a Leader in Gartner Magic Quadrant for PAM in subsequent years, offering cloud-ready modern PAM founded on Zero Trust principles with DirectControl for centralizing heterogeneous identities"},{"name":"IBM Security","notes":"Providing comprehensive IAM portfolio including IBM Security Privileged Identity Manager and IBM Security Identity Manager, addressing enterprise-scale privileged access with integration across IBM Tivoli products"},{"name":"CA Technologies","notes":"Offering CA Privileged Access Manager combining access control and credential management for controlling and tracking privileged user access to critical infrastructure with complete auditing capabilities"},{"name":"ARCON PAM","notes":"Delivering enterprise-class privileged access management solution with lifecycle management of privileged accounts, offering scalability across all IT environments"},{"name":"One Identity","notes":"Part of Quest Software, providing robust role-based access control, identity governance, and PAM features highly customizable for large enterprises with complex needs"}]},"2020":{"query":"CyberArk competitors 2020 identity security PAM market","date":"2024-12-24","context":"CyberArk Software Ltd. is a identity security company focused on privileged access management, identity security, and secrets management. Identity security platform. Remote privileged access critical.","sources":["https://growhackscale.com/competitors/cyberark-identity-alternatives","https://www.netify.com/top-best-privileged-access-management-pam-vendor-solutions","https://www.beyondtrust.com/blog/entry/gartner-pam-magic-quadrant","https://delinea.com/centrify","https://www.gartner.com/reviews/market/privileged-access-management","https://www.silverfort.com/blog/leading-alternatives-to-cyberark/"],"competitors":[{"name":"BeyondTrust","notes":"Leading PAM competitor recognized as a Leader in Gartner Magic Quadrant for PAM for six consecutive years, offering comprehensive privilege management across all users, assets, and sessions with SaaS and on-premises options"},{"name":"Thycotic","notes":"Major PAM vendor offering Secret Server and comprehensive privileged access solutions with strong focus on cloud and on-premises security, before merging with Centrify in 2021 to form Delinea"},{"name":"Centrify","notes":"Named a Leader in Gartner Magic Quadrant for PAM in 2018, 2020, and 2021, offering industry's first multi-tenant cloud-architected PAM with FedRAMP authorization and Zero Trust principles"},{"name":"One Identity","notes":"Formidable competitor offering comprehensive PAM suite addressing various privileged access security aspects with robust role-based access control and identity governance for large enterprises"},{"name":"ManageEngine PAM360","notes":"Identified as a challenger rapidly gaining significant market share in the PAM market, offering alternative licensing flexibility and simpler deployment compared to established leaders"},{"name":"HashiCorp Vault","notes":"Cloud-native secrets management solution securing passwords, tokens, and encryption keys, generating over 10,000 unique tokens daily with automated application delivery and strong integration capabilities"},{"name":"Microsoft","notes":"Competing with Azure AD (now Entra ID) identity and access management capabilities, integrating privileged access management into broader cloud security portfolio"},{"name":"Okta","notes":"Cloud identity provider offering PAM capabilities through Advanced Server Access product, providing strong platform for managing user access and securing applications"},{"name":"IBM Security","notes":"Providing comprehensive cybersecurity solutions including privileged access management, identity governance, and threat intelligence with robust access controls and real-time monitoring"},{"name":"WALLIX PAM","notes":"Leading agentless PAM solution deployable across on-premises, private, and public cloud infrastructures, delivering robust security and oversight over privileged access to critical IT infrastructure"},{"name":"ARCON PAM","notes":"Enterprise-class PAM solution offering highly scalable privileged account lifecycle management working seamlessly in all IT environments"}]},"2024":{"query":"CyberArk competitors 2024 privileged access management","date":"2024-12-24","context":"CyberArk Software Ltd. is a identity security company focused on privileged access management, identity security, and secrets management. Workforce and machine identity. SaaS-first platform.","sources":["https://www.silverfort.com/blog/leading-alternatives-to-cyberark/","https://inteca.com/business-insights/cyberark-alternatives-in-2025-for-pam/","https://pitchgrade.com/companies/cyberark-software","https://www.gartner.com/reviews/market/privileged-access-management/vendor/cyberark/alternatives","https://www.beyondtrust.com/blog/entry/gartner-pam-magic-quadrant","https://www.researchandmarkets.com/report/privileged-access-management","https://growhackscale.com/competitors/cyberark-identity-alternatives"],"competitors":[{"name":"BeyondTrust","notes":"Prominent competitor recognized as a Leader in Gartner Magic Quadrant for PAM for seven consecutive years, specializing in privileged access management and vulnerability management with comprehensive safeguards for sensitive data and user access control"},{"name":"Delinea","notes":"Formed from 2021 merger of Thycotic and Centrify, offering comprehensive PAM solutions with Secret Server and cloud-ready modern PAM based on Zero Trust principles, focusing on securing legacy and cloud environments with seamless integration"},{"name":"Microsoft Entra ID","notes":"Named the best overall CyberArk Privileged Access Manager alternative, integrating privileged access management into comprehensive cloud identity and access management platform with native Azure integration"},{"name":"HashiCorp Vault","notes":"Leading cloud-native secrets management alternative delivering strong integration and customization, appealing to organizations seeking flexible and cost-effective secret management with reliable cloud support and automated credential lifecycle"},{"name":"Okta","notes":"Well-known cloud identity provider competing with strong platform for managing user access and securing applications, offering PAM capabilities through Advanced Server Access product"},{"name":"One Identity","notes":"Providing comprehensive PAM suite with robust role-based access control and streamlined identity governance, highly customizable and working well for large enterprises with complex needs"},{"name":"ManageEngine PAM360","notes":"Continuing to gain market share as a challenger offering simpler deployment and alternative licensing flexibility compared to CyberArk, catering to diverse organizational needs"},{"name":"WALLIX PAM","notes":"Leading agentless PAM solution available as service or for deployment across on-premises, private, and public cloud infrastructures, delivering robust security oversight over privileged access to critical IT infrastructure"},{"name":"ARCON PAM","notes":"Enterprise IT security solution offering highly scalable privileged access management working seamlessly in all IT environments to secure privileged account lifecycle"},{"name":"IBM Security","notes":"Providing comprehensive cybersecurity solutions including privileged access management, identity governance, and threat intelligence with robust access controls, audit capabilities, and real-time monitoring"},{"name":"Silverfort","notes":"Automatically detecting and classifying all privileged users, applying Just-In-Time policies across all users with real-time access control and MFA, featuring seamless integration across legacy, hybrid, and cloud ecosystems"},{"name":"StrongDM","notes":"Specializing in Zero Trust Privileged Access Management within security domain, offering platform with policy-based controls, continuous authorization, and simplified access management to databases, servers, and Kubernetes"},{"name":"Zluri","notes":"Offering cutting-edge access management solutions with accurate user access data discovery, effective employee access management, thorough monitoring of access activities, regular audits, and curated reports"},{"name":"Saviynt","notes":"Providing identity governance and cloud security solutions competing in areas like access certification and privileged access governance"},{"name":"Britive","notes":"Focusing on cloud-native privileged access management (CPAM), offering platform for access to cloud and hybrid environments while addressing standing privileges and access management for identities"}]},"2025":{"query":"CyberArk competitors 2025 privileged access management","date":"2025-12-24","context":"CyberArk Software Ltd. is a identity security company focused on privileged access management, identity security, and secrets management. Identity security leader. Competing with Okta, Microsoft, BeyondTrust.","sources":["https://www.gartner.com/reviews/market/privileged-access-management/vendor/cyberark/alternatives","https://inteca.com/business-insights/cyberark-alternatives-in-2025-for-pam/","https://www.g2.com/products/cyberark-privileged-access-manager/competitors/alternatives","https://www.infisign.ai/blog/top-cyberark-competitors-and-alternatives","https://www.strongdm.com/blog/privileged-access-management-solutions","https://www.strongdm.com/blog/alternatives-to-cyberark"],"competitors":[{"name":"Microsoft Entra ID","notes":"Best overall CyberArk PAM alternative. Comprehensive identity and access management cloud solution providing robust set of capabilities to manage users and groups and help secure access to applications including Microsoft online services like Office 365 and non-Microsoft SaaS applications. Strong for Microsoft-centric environments."},{"name":"BeyondTrust","notes":"BeyondTrust Privilege Management approach secures every user, asset, and session across enterprise. Deployed as SaaS or on-premises. Universal Privilege Management approach simplifies deployments, reduces costs, improves usability, and reduces privilege risks. Includes Privileged Remote Access capabilities."},{"name":"HashiCorp Vault","notes":"Secrets manager that securely stores and controls access to encryption keys, passwords, tokens, and certificates. Allows organizations to generate over 10,000 unique tokens per day and automate application delivery. Developer-friendly approach to secrets management."},{"name":"Delinea","notes":"Product of merger between Thycotic and Centrify. Provides comprehensive PAM solution that's easy to install, configure, and manage. Offers series of top PAM solutions companies can combine to customize access management capabilities. Includes Secret Server."},{"name":"Okta","notes":"Well-known cloud identity provider offering strong platform for managing user access and securing applications. Provides PAM capabilities through Advanced Server Access product. Strong in identity management and SSO."},{"name":"One Identity","notes":"Provides comprehensive set of features for managing privileged accounts, governing access, and meeting compliance requirements. Focus on automation and identity analytics makes it suitable for organizations with complex security needs. Leading CyberArk competitor."},{"name":"WALLIX PAM","notes":"Formerly Wallix Bastion. Leading PAM solution delivering robust security and oversight over privileged access to critical IT infrastructure. Essential for mitigating cyber-attacks as hackers exploit privileged accounts. Agentless solution seamlessly deployed across on-premises, private, and public cloud infrastructures."},{"name":"StrongDM","notes":"Modern Cloud PAM solution built to support variety of cloud networks including public, private, multi-cloud, and hybrid. Easy deployment through self-healing mesh network of proxies. Cloud-native approach."},{"name":"JumpCloud","notes":"Delivers unified identity, device, and access management platform making it easy to securely manage identities, devices, and access across organization. IT teams and MSPs enable users to work securely from anywhere and manage Windows, Apple, Linux, and Android devices from single platform."},{"name":"ARCON Privileged Access Management","notes":"Alternative PAM solution offering privileged access security and session management capabilities for enterprise environments."}]}},"mentionedBy":[{"slug":"hashicorp","name":"HashiCorp Inc.","ticker":"HCP","year":2020,"notes":"Primary competitor for Vault in secrets and privileged access management"},{"slug":"hashicorp","name":"HashiCorp Inc.","ticker":"HCP","year":2024,"notes":"Primary competitor in privileged access and secrets management"},{"slug":"hashicorp","name":"HashiCorp Inc.","ticker":"HCP","year":2025,"notes":"Competes with HashiCorp Vault in the privileged access management and secrets management space for enterprise security."},{"slug":"okta","name":"Okta Inc.","ticker":"OKTA","year":2024,"notes":"Best for privileged access for admin accounts and critical systems"},{"slug":"okta","name":"Okta Inc.","ticker":"OKTA","year":2025,"notes":"Known for intuitive interface and privileged access management. Offers MFA and self-hosting options that integrate easily with other security solutions. Best for large enterprises requiring robust access controls and data security management. Limited reporting features."},{"slug":"varonis","name":"Varonis Systems Inc.","ticker":"VRNS","year":2015,"notes":"Privileged access management"},{"slug":"varonis","name":"Varonis Systems Inc.","ticker":"VRNS","year":2024,"notes":"Privileged access management"}],"competitors":[{"slug":"ibm-tivoli","name":"IBM Tivoli","ticker":null,"isPublic":false,"entityType":"division","parentSlug":"ibm","financials":null,"financialsByYear":null},{"slug":"ca","name":"CA Technologies","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"thycotic","name":"Thycotic","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"beyondtrust-formerly-bomgar","name":"BeyondTrust (formerly Bomgar)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"centrify","name":"Centrify","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"beyondtrust","name":"BeyondTrust","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$350M","market_cap":null,"revenue_raw":350000000,"market_cap_raw":null},"financialsByYear":{"2024":{"revenue":"$350M","revenue_raw":350000000}}},{"slug":"quest-one-identity","name":"Quest Software (One Identity)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"ibm-security","name":"IBM Security","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"arcon-pam","name":"ARCON PAM","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"one-identity","name":"One Identity","ticker":null,"isPublic":false,"entityType":"division","parentSlug":"quest-software","financials":{"revenue_2024":"$750M","market_cap":null,"revenue_raw":750000000,"market_cap_raw":null},"financialsByYear":{"2024":{"revenue":"$500M","revenue_raw":500000000},"2025":{"revenue":"$750M","revenue_raw":750000000}}},{"slug":"manageengine-pam360","name":"ManageEngine PAM360","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"hashicorp","name":"HashiCorp Inc.","ticker":"HCP","isPublic":true,"entityType":"division","parentSlug":"ibm","financials":{"revenue_2024":"$583M","market_cap":"$6.4B","revenue_raw":583000000,"market_cap_raw":6400000000},"financialsByYear":{"2021":{"revenue":"$320M","revenue_raw":320000000,"market_cap":"$12B","market_cap_raw":12000000000},"2024":{"revenue":"$583M","revenue_raw":583000000,"market_cap":"$6.4B","market_cap_raw":6400000000}}},{"slug":"microsoft","name":"Microsoft Corporation","ticker":"MSFT","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$245B","market_cap":"$3.1T","revenue_raw":245000000000,"market_cap_raw":3100000000000},"financialsByYear":{"2000":{"revenue":"$23B","revenue_raw":23000000000,"market_cap":"$550B","market_cap_raw":550000000000},"2005":{"revenue":"$40B","revenue_raw":40000000000,"market_cap":"$280B","market_cap_raw":280000000000},"2010":{"revenue":"$62B","revenue_raw":62000000000,"market_cap":"$240B","market_cap_raw":240000000000},"2015":{"revenue":"$94B","revenue_raw":94000000000,"market_cap":"$400B","market_cap_raw":400000000000},"2020":{"revenue":"$143B","revenue_raw":143000000000,"market_cap":"$1.6T","market_cap_raw":1600000000000},"2024":{"revenue":"$212B","revenue_raw":212000000000,"market_cap":"$2.8T","market_cap_raw":2800000000000},"2025":{"revenue":"$245B","revenue_raw":245000000000,"market_cap":"$3.1T","market_cap_raw":3100000000000}}},{"slug":"okta","name":"Okta Inc.","ticker":"OKTA","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$2.26B","market_cap":"$16B","revenue_raw":2260000000,"market_cap_raw":16000000000},"financialsByYear":{"2020":{"revenue":"$586M","revenue_raw":586000000,"market_cap":"$20B","market_cap_raw":20000000000},"2024":{"revenue":"$2.26B","revenue_raw":2260000000,"market_cap":"$16B","market_cap_raw":16000000000}}},{"slug":"wallix-pam","name":"WALLIX PAM","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"delinea","name":"Delinea","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$200M","market_cap":null,"revenue_raw":200000000,"market_cap_raw":null},"financialsByYear":{"2022":{"revenue":"$200M","revenue_raw":200000000}}},{"slug":"silverfort","name":"Silverfort","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"strongdm","name":"StrongDM","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"zluri","name":"Zluri","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"saviynt","name":"Saviynt","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"britive","name":"Britive","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"jumpcloud","name":"JumpCloud","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$200M","market_cap":"$2.6B","revenue_raw":200000000,"market_cap_raw":2600000000},"financialsByYear":{"2021":{"revenue":"$47M","revenue_raw":47000000,"market_cap":"$2.6B","market_cap_raw":2600000000},"2024":{"revenue":"$200M","revenue_raw":200000000,"market_cap":"$2.6B","market_cap_raw":2600000000}}},{"slug":"arcon-privileged-access-management","name":"ARCON Privileged Access Management","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null}]}