{"slug":"informatica","name":"Informatica","ticker":"INFA","isPublic":true,"entityType":"company","ownership":"public","parentCompany":null,"parentSlug":null,"financials":{"revenue_2024":"$1.7B","market_cap":"$8B","revenue_raw":1700000000,"market_cap_raw":8000000000},"financialsByYear":{"2021":{"revenue":"$1.4B","revenue_raw":1400000000,"market_cap":"$9B","market_cap_raw":9000000000},"2024":{"revenue":"$1.7B","revenue_raw":1700000000,"market_cap":"$8B","market_cap_raw":8000000000}},"years":{"2000":{"query":"Informatica competitors 2000","date":"2025-12-24","context":"Informatica Inc. is a enterprise data management software company focused on data integration, quality, governance, and cloud data management. ETL and data integration tools. Data warehouse loading.","sources":["https://etl-tools.info/en/datastage.html","https://sites.google.com/site/jmdstips/datastage/the-history-of-datastage","https://en.wikipedia.org/wiki/IBM_InfoSphere_DataStage","https://tdwi.org/articles/2005/04/13/examining-the-aftershocks-of-ibms-ascential-acquisition.aspx","https://www.datagenx.net/2015/08/datastage-journey-from-vmark-to-ibm.html"],"competitors":[{"name":"Ascential DataStage","notes":"DataStage originated at VMark Software (1996-1997). VMark and Unidata merged in 1997 to form Ardent Software, which was acquired by Informix in 1999. In 2001, IBM acquired Informix's database business and DataStage was spun off as part of independent Ascential Software. Market-leading ETL vendor competing directly with Informatica."},{"name":"IBM","notes":"IBM acquired Informix in April 2001 and spun off the data integration tools as Ascential Software, making them a major competitor in enterprise data integration."},{"name":"SAS Enterprise ETL","notes":"SAS Institute's ETL tool, considered top three alongside Informatica and Ascential by industry analysts."},{"name":"Oracle","notes":"Oracle provided data integration capabilities within their database ecosystem."},{"name":"Microsoft DTS","notes":"Microsoft Data Transformation Services (DTS) was part of SQL Server, offering basic ETL capabilities for Microsoft-centric environments."},{"name":"BusinessObjects","notes":"BusinessObjects competed with data integration and BI tools, later acquiring data integration capabilities."}]},"2005":{"query":"Informatica competitors 2005","date":"2025-12-24","context":"Informatica Inc. is a enterprise data management software company focused on data integration, quality, governance, and cloud data management. Data quality and master data management expansion.","sources":["https://tdwi.org/articles/2005/04/13/examining-the-aftershocks-of-ibms-ascential-acquisition.aspx","https://www.datagenx.net/2015/08/datastage-journey-from-vmark-to-ibm.html","https://etl-tools.info/en/datastage.html","https://bloorresearch.com/2006/05/the-evolution-of-integration-platforms/","https://www.gartner.com/reviews/market/data-integration-tools/vendor/informatica/alternatives"],"competitors":[{"name":"IBM InfoSphere DataStage","notes":"IBM acquired Ascential Software in March 2005, making DataStage part of the WebSphere family as WebSphere DataStage. Ascential had acquired Torrent Systems (2001), Vality, Metagenix, and Mercator to build comprehensive data integration suite. This was a market-leading ETL vendor before acquisition."},{"name":"SAS Enterprise ETL","notes":"SAS Institute's market-leading ETL tool, consistently ranked in top three by Forrester Research and META Group alongside Informatica and Ascential."},{"name":"Oracle Data Integrator","notes":"Oracle's ETL solution competing for enterprise database integration workloads."},{"name":"Microsoft SQL Server Integration Services (SSIS)","notes":"Replaced DTS with SQL Server 2005, offering more robust ETL capabilities within Microsoft ecosystem."},{"name":"BusinessObjects Data Integrator","notes":"BusinessObjects acquired Medience and launched BusinessObjects Data Federator, competing in data integration space."},{"name":"Talend","notes":"Early open-source ETL alternative beginning to emerge as competitor to enterprise solutions."},{"name":"NCR Teradata","notes":"Had existing partnerships with Ascential before IBM acquisition, offering ETL capabilities for data warehousing."}]},"2010":{"query":"Informatica competitors 2010","date":"2025-12-24","context":"Informatica Inc. is a enterprise data management software company focused on data integration, quality, governance, and cloud data management. Cloud data integration beginning. Big data support.","sources":["https://www.globenewswire.com/news-release/2010/05/17/421148/11123/en/Informatica-PowerCenter-Identified-as-Most-Widely-Used-ETL-Technology-in-Independent-Research-Report.html","https://hevodata.com/learn/informatica-alternatives/","https://www.astera.com/type/blog/informatica-alternatives/","https://estuary.dev/blog/informatica-alternatives/","https://dataterrain.com/etl-tool-comparison-oracle-data-integrator-vs-informatica/"],"competitors":[{"name":"IBM InfoSphere DataStage","notes":"Enterprise-grade ETL solution with parallel processing capabilities, part of IBM Information Server suite. Released as part of Information Management family in 2006, employing parallel processing across multiple nodes for high-volume data integration."},{"name":"Oracle Data Integrator (ODI)","notes":"Powerful ETL tool for Oracle ecosystem integration, competing directly with Informatica PowerCenter for enterprise data warehousing projects."},{"name":"Microsoft SQL Server Integration Services (SSIS)","notes":"Enterprise-level ETL tool within Microsoft ecosystem, providing robust workflow automation and seamless integration with Microsoft products."},{"name":"Talend","notes":"Leading open-source ETL tool (Talend Open Studio) gaining traction as cost-effective alternative. Strong focus on data governance, quality, and compliance with both open-source and enterprise editions."},{"name":"SAP Data Services","notes":"SAP's data integration and ETL platform for SAP environments, competing in enterprise market."},{"name":"SAS Data Integration","notes":"SAS Institute's ETL and data quality platform for analytics-focused organizations."},{"name":"Dell Boomi","notes":"Emerging cloud-based integration platform as a service (iPaaS) beginning to challenge traditional on-premises ETL tools."},{"name":"Apache NiFi","notes":"Open-source data integration platform developed by NSA, focusing on real-time data flow automation rather than traditional batch ETL."}]},"2015":{"query":"Informatica competitors 2015","date":"2025-12-24","context":"Informatica Inc. is a enterprise data management software company focused on data integration, quality, governance, and cloud data management. Went private. Cloud platform investment.","sources":["https://www.g2.com/products/informatica-cloud-data-integration/competitors/alternatives","https://www.gartner.com/reviews/market/data-integration-tools/vendor/informatica/product/informatica-cloud-data-integration/alternatives","https://www.matillion.com/learn/blog/informatica-alternatives","https://apix-drive.com/en/blog/other/informatica-cloud-competitors","https://6sense.com/tech/data-integration/informatica-cloud-market-share"],"competitors":[{"name":"MuleSoft Anypoint Platform","notes":"Leading iPaaS solution for hybrid enterprise integration, focusing on API-led connectivity and SOA. Complete platform for APIs, applications, and products with Mule as core runtime engine. Strong competitor for cloud integration workloads."},{"name":"Microsoft Azure Data Factory","notes":"Scalable cloud-native data integration service in Azure ecosystem. Top competitor with 4.71% market share against Informatica Cloud. Cloud-first approach attracting Microsoft-centric organizations."},{"name":"Dell Boomi","notes":"Cloud-based integration platform as a service (iPaaS) with drag-and-drop interface. Fully managed platform connecting cloud and on-premises data sources, competing directly with Informatica Cloud offerings."},{"name":"Talend Cloud","notes":"Extensive data integration and transformation features with cloud capabilities. Comprehensive suite for data integration, data quality, and governance. Strong open-source heritage with enterprise cloud edition."},{"name":"IBM InfoSphere DataStage","notes":"Enterprise ETL solution with advanced parallel processing. More expensive than competitors with complex initial setup but strong in large-scale enterprise deployments."},{"name":"SAP Data Services","notes":"Comprehensive data integration, quality, and cleansing for SAP environments. Held 3.08% market share in cloud data integration category."},{"name":"SnapLogic","notes":"Cloud data integration and iPaaS vendor gaining market share with self-service capabilities."},{"name":"AWS Glue","notes":"Amazon's emerging data integration service supporting ETL, ELT, replication, batch and stream processing within AWS ecosystem."},{"name":"Google Cloud Dataflow","notes":"Google's cloud-native data processing service for batch and streaming data integration."},{"name":"Fivetran","notes":"Cloud-based automated data pipeline platform founded in 2012, offering automated ETL/ELT processes."}]},"2020":{"query":"Informatica competitors 2020","date":"2025-12-24","context":"Informatica Inc. is a enterprise data management software company focused on data integration, quality, governance, and cloud data management. IPO second time. Intelligent Data Management Cloud.","sources":["https://www.matillion.com/learn/blog/informatica-alternatives","https://www.astera.com/type/blog/informatica-alternatives/","https://estuary.dev/blog/informatica-alternatives/","https://coalesce.io/data-insights/top-10-informatica-alternatives-and-competitors/","https://www.integrate.io/blog/top-5-informatica-alternatives/"],"competitors":[{"name":"Talend (Qlik)","notes":"One of Informatica's longest-standing competitors with broad suite for data integration, transformation, quality, and governance. Strong in enterprise integration space with both on-premises and cloud capabilities."},{"name":"Fivetran","notes":"Cloud-native automated data pipeline platform handling schema drift, incremental updates, and monitoring out-of-the-box. Hands-off ingestion layer allowing engineers to focus on transformation rather than connector maintenance. Major disruptor to traditional ETL."},{"name":"Matillion","notes":"Cloud-native data integration platform built specifically for cloud data warehouses (Snowflake, Databricks, BigQuery). Visual, low-code interface for data engineers and business analysts. More streamlined and cost-effective than Informatica's broad enterprise focus."},{"name":"MuleSoft (Salesforce)","notes":"Anypoint Platform excels in API management with extensive connector support, catering to API-led integration strategies. Strong in hybrid cloud enterprise integration."},{"name":"IBM InfoSphere DataStage","notes":"Enterprise-grade ETL with parallel processing for high-volume workloads. Among best alternatives according to end users, though expensive with complex setup and less user-friendly UI."},{"name":"Oracle Data Integrator","notes":"Powerful ETL tool for Oracle-centric environments. Considered best overall alternative by individual end users."},{"name":"SAP Data Services","notes":"Unlocks meaning from structured and unstructured data with best-in-class functionality for data integration, quality, and cleansing."},{"name":"Apache NiFi","notes":"Open-source platform emphasizing real-time data flow automation. Developed by NSA, focuses on real-time flow-based processing vs. traditional batch ETL."},{"name":"AWS Glue","notes":"Serverless data integration from Amazon for ETL, ELT, replication, batch and stream processing. Part of AWS ecosystem."},{"name":"Azure Data Factory","notes":"Microsoft's cloud-native data integration service, scalable and highly integrated for Azure-centric organizations."},{"name":"Dell Boomi","notes":"Cloud-based iPaaS solution with drag-and-drop interface for enterprise integration across diverse systems."}]},"2024":{"query":"Informatica competitors 2024","date":"2025-12-24","context":"Informatica Inc. is a enterprise data management software company focused on data integration, quality, governance, and cloud data management. CLAIRE AI engine. Cloud data management growth.","sources":["https://www.intelmarketresearch.com/integration-platform-as-a-service-market-11880","https://www.oneio.cloud/blog/ipaas-solutions-and-vendors-compared","https://www.jitterbit.com/blog/best-enterprise-ipaas-vendors/","https://www.matillion.com/learn/blog/informatica-alternatives","https://www.taloflow.ai/guides/comparisons/informatica-intelligent-cloud-services-vs-oracle-integration-cloud-ipaas","https://sourceforge.net/software/product/Informatica-Cloud-Data-Integration/alternatives"],"competitors":[{"name":"Dell Boomi","notes":"Powerful cloud-based iPaaS with drag-and-drop interface simplifying data integration. Fully managed platform connecting cloud and on-premises sources. Market leader in iPaaS category with significant share of 56% held by top 5 players."},{"name":"MuleSoft (Salesforce)","notes":"Combines iPaaS, API Management, and ESB in three-layered API architecture. Anypoint Exchange popular among enterprises. Mulesoft Compose provides low-code Salesforce integrations. Major player in top 5 iPaaS vendors."},{"name":"Talend (Qlik)","notes":"Qlik officially discontinued Talend Open Studio on January 31, 2024. Qlik Talend Cloud is now core subscription-based data integration platform for cloud and hybrid environments with automated data workflows. Part of top 5 iPaaS market leaders."},{"name":"SnapLogic","notes":"Low-code iPaaS for enterprise integration with AI-powered tools to optimize and automate workflows across hybrid IT environments. One of top 5 iPaaS vendors with significant market share."},{"name":"Matillion","notes":"Cloud-native platform built for cloud data warehouses. Visual, low-code interface for engineers and analysts. ETL rated positively for user-friendly interface, cloud integration, visual job orchestration, reliability and scalability."},{"name":"Microsoft Azure Data Factory","notes":"Scalable, secure, highly integrated cloud-native data integration tool ideal for businesses seeking solution that grows with data needs. Strong for Azure-centric organizations."},{"name":"Celigo","notes":"Modern iPaaS focused on SaaS integrations and business process automation for mid-market. Integrator.io targets upper-midmarket and small enterprises for back-office automation with AI innovations."},{"name":"Fivetran","notes":"Cloud-based automated data extraction and loading for complex data pipelines with flexibility for ETL/ELT strategies based on business needs."},{"name":"SAP Integration Suite","notes":"iPaaS allowing seamless integration of on-premise and cloud applications with tools and prebuilt content managed by SAP."},{"name":"Jitterbit Harmony","notes":"Versatile iPaaS originally for SMBs, expanded into enterprise integration focusing on flexibility and value."},{"name":"IBM","notes":"Key player in iPaaS market with integration platform offerings."},{"name":"Oracle Integration Cloud","notes":"Oracle's iPaaS competing with Informatica Intelligent Cloud Services for enterprise integration."},{"name":"TIBCO Software","notes":"Enterprise integration and API management platform vendor in iPaaS market."},{"name":"Workato","notes":"Enterprise automation and iPaaS platform with AI-powered integration capabilities."}]},"2025":{"query":"Informatica competitors 2025","date":"2025-12-24","context":"Informatica Inc. is a enterprise data management software company focused on data integration, quality, governance, and cloud data management. Enterprise data management leader. AI-powered data platform.","sources":["https://www.salesforce.com/news/press-releases/2025/11/18/salesforce-completes-acquisition-of-informatica/?bc=OTH","https://www.informatica.com/about-us/news/news-releases/2025/11/20251118-salesforce-completes-acquisition-of-informatica.html","https://investor.salesforce.com/news/news-details/2025/Salesforce-Signs-Definitive-Agreement-to-Acquire-Informatica/default.aspx","https://techcrunch.com/2025/05/27/salesforce-acquires-informatica-for-8-billion/","https://www.marketbeat.com/stocks/NYSE/INFA/competitors-and-alternatives/","https://www.gartner.com/reviews/market/data-integration-tools/vendor/informatica/alternatives","https://hevodata.com/learn/informatica-alternatives/","https://www.astera.com/type/blog/informatica-alternatives/","https://coalesce.io/data-insights/top-10-informatica-alternatives-and-competitors/"],"competitors":[{"name":"Talend (Qlik)","notes":"Leading alternative with comprehensive suite for data integration, transformation, quality, and governance. Now operates under Qlik's data integration and analytics ecosystem, combining ETL with data quality, governance, and observability features. Strong focus on AI-powered capabilities."},{"name":"Matillion","notes":"Cloud-native platform built for cloud data warehouses (Snowflake, Databricks, BigQuery). Visual, low-code interface accessible to engineers and business analysts. Unlike Informatica's broad enterprise focus, Matillion specializes in leveraging cloud data platform power and scalability. More streamlined and cost-effective for cloud-first organizations."},{"name":"dbt Labs","notes":"dbt Cloud brings software engineering best practices to analytics engineering workflow. Focuses specifically on transformation layer of modern data stack. Enables analytics engineers to work like software developers with version control, testing, and documentation built into data transformation."},{"name":"Fivetran","notes":"Handles schema drift, incremental updates, and pipeline monitoring out-of-the-box. Allows data engineers to focus on transformation and analytics rather than connector maintenance. Hands-off, cloud-native ingestion layer for organizations burdened by complex on-prem connectors."},{"name":"IBM InfoSphere DataStage","notes":"Enterprise-grade ETL employing parallel processing distributing large workloads across multiple nodes for massive datasets. More expensive with complex initial setup and less user-friendly UI compared to competitors."},{"name":"AWS Glue","notes":"Serverless data integration from Amazon for ETL, ELT, replication, batch and stream processing. Simplifies data integration by modernizing ETL with automatic provisioning and worker management. Goals: faster and cheaper data preparation for ML and analytics."},{"name":"Hevo Data","notes":"Fully managed, no-code data pipeline platform for real-time data integration and transformation. Compelling alternative for teams seeking simplicity, speed, and minimal infrastructure overhead. Automates every step from extraction to transformation to loading."},{"name":"Alteryx","notes":"Excellent for organizations looking to go beyond traditional ETL and incorporate advanced analytics. High cost and resource requirements may be prohibitive for smaller businesses."},{"name":"Precisely","notes":"Specializes in data integrity providing accuracy and consistency in data for customers."},{"name":"SnapLogic","notes":"Provides iPaaS solution for enterprises specializing in self-service integration with AI-powered capabilities."},{"name":"Workato","notes":"Specializes in AI-powered enterprise automation with integration platform capabilities."},{"name":"Airbyte","notes":"Open-source data integration platform emerging as modern alternative to traditional ETL tools."},{"name":"Astera","notes":"Data integration and management platform competing in enterprise space."},{"name":"Skyvia","notes":"Cloud data integration platform offering alternative to Informatica for SMB and mid-market."}]}},"mentionedBy":[],"competitors":[{"slug":"ascential-datastage","name":"Ascential DataStage","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"ibm","name":"IBM Corporation","ticker":"IBM","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$63B","market_cap":"$283B","revenue_raw":63000000000,"market_cap_raw":283000000000},"financialsByYear":{"2000":{"revenue":"$88B","revenue_raw":88000000000,"market_cap":"$208B","market_cap_raw":208000000000},"2005":{"revenue":"$91B","revenue_raw":91000000000,"market_cap":"$130B","market_cap_raw":130000000000},"2010":{"revenue":"$100B","revenue_raw":100000000000,"market_cap":"$180B","market_cap_raw":180000000000},"2015":{"revenue":"$82B","revenue_raw":82000000000,"market_cap":"$140B","market_cap_raw":140000000000},"2020":{"revenue":"$73B","revenue_raw":73000000000,"market_cap":"$110B","market_cap_raw":110000000000},"2024":{"revenue":"$62B","revenue_raw":62000000000,"market_cap":"$170B","market_cap_raw":170000000000},"2025":{"revenue":"$63B","revenue_raw":63000000000,"market_cap":"$283B","market_cap_raw":283000000000}}},{"slug":"sas-enterprise-etl","name":"SAS Enterprise ETL","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$57B","market_cap":"$490B","revenue_raw":57000000000,"market_cap_raw":490000000000},"financialsByYear":{"2000":{"revenue":"$10.1B","revenue_raw":10100000000,"market_cap":"$170B","market_cap_raw":170000000000},"2005":{"revenue":"$11.8B","revenue_raw":11800000000,"market_cap":"$75B","market_cap_raw":75000000000},"2010":{"revenue":"$27B","revenue_raw":27000000000,"market_cap":"$130B","market_cap_raw":130000000000},"2015":{"revenue":"$38B","revenue_raw":38000000000,"market_cap":"$180B","market_cap_raw":180000000000},"2020":{"revenue":"$39B","revenue_raw":39000000000,"market_cap":"$175B","market_cap_raw":175000000000},"2024":{"revenue":"$53B","revenue_raw":53000000000,"market_cap":"$320B","market_cap_raw":320000000000},"2025":{"revenue":"$57B","revenue_raw":57000000000,"market_cap":"$490B","market_cap_raw":490000000000}}},{"slug":"microsoft","name":"Microsoft Corporation","ticker":"MSFT","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$245B","market_cap":"$3.1T","revenue_raw":245000000000,"market_cap_raw":3100000000000},"financialsByYear":{"2000":{"revenue":"$23B","revenue_raw":23000000000,"market_cap":"$550B","market_cap_raw":550000000000},"2005":{"revenue":"$40B","revenue_raw":40000000000,"market_cap":"$280B","market_cap_raw":280000000000},"2010":{"revenue":"$62B","revenue_raw":62000000000,"market_cap":"$240B","market_cap_raw":240000000000},"2015":{"revenue":"$94B","revenue_raw":94000000000,"market_cap":"$400B","market_cap_raw":400000000000},"2020":{"revenue":"$143B","revenue_raw":143000000000,"market_cap":"$1.6T","market_cap_raw":1600000000000},"2024":{"revenue":"$212B","revenue_raw":212000000000,"market_cap":"$2.8T","market_cap_raw":2800000000000},"2025":{"revenue":"$245B","revenue_raw":245000000000,"market_cap":"$3.1T","market_cap_raw":3100000000000}}},{"slug":"businessobjects","name":"BusinessObjects","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"ibm-infosphere-datastage","name":"IBM InfoSphere DataStage","ticker":null,"isPublic":false,"entityType":"product","parentSlug":"ibm","financials":null,"financialsByYear":null},{"slug":"businessobjects-data-integrator","name":"BusinessObjects Data Integrator","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"talend","name":"Talend","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$340M","market_cap":"$2.4B","revenue_raw":340000000,"market_cap_raw":2400000000},"financialsByYear":{"2022":{"revenue":"$340M","revenue_raw":340000000,"market_cap":"$2.4B","market_cap_raw":2400000000}}},{"slug":"ncr-teradata","name":"NCR Teradata","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"sap-data-services","name":"SAP Data Services","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"sas-data-integration","name":"SAS Data Integration","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"dell","name":"Dell Technologies","ticker":"DELL","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$96B","market_cap":"$87B","revenue_raw":96000000000,"market_cap_raw":87000000000},"financialsByYear":{"2000":{"revenue":"$25B","revenue_raw":25000000000,"market_cap":"$100B","market_cap_raw":100000000000},"2005":{"revenue":"$49B","revenue_raw":49000000000,"market_cap":"$72B","market_cap_raw":72000000000},"2010":{"revenue":"$61B","revenue_raw":61000000000,"market_cap":"$28B","market_cap_raw":28000000000},"2020":{"revenue":"$92B","revenue_raw":92000000000,"market_cap":"$35B","market_cap_raw":35000000000},"2024":{"revenue":"$88B","revenue_raw":88000000000,"market_cap":"$60B","market_cap_raw":60000000000},"2025":{"revenue":"$96B","revenue_raw":96000000000,"market_cap":"$87B","market_cap_raw":87000000000}}},{"slug":"apache-nifi","name":"Apache NiFi","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"mulesoft-anypoint-platform","name":"MuleSoft Anypoint Platform","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"talend-cloud","name":"Talend Cloud","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"snaplogic","name":"SnapLogic","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"aws-glue","name":"AWS Glue","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"google-cloud-dataflow","name":"Google Cloud Dataflow","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"fivetran","name":"Fivetran","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$325M","market_cap":"$5.6B","revenue_raw":325000000,"market_cap_raw":5600000000},"financialsByYear":{"2020":{"revenue":"$60M","revenue_raw":60000000},"2022":{"revenue":"$190M","revenue_raw":190000000},"2024":{"revenue":"$325M","revenue_raw":325000000,"market_cap":"$5.6B","market_cap_raw":5600000000}}},{"slug":"talend-qlik","name":"Talend (Qlik)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"matillion","name":"Matillion","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$100M","market_cap":null,"revenue_raw":100000000,"market_cap_raw":null},"financialsByYear":{"2021":{"revenue":"$50M","revenue_raw":50000000,"market_cap":"$1.5B","market_cap_raw":1500000000},"2024":{"revenue":"$100M","revenue_raw":100000000}}},{"slug":"mulesoft-salesforce","name":"MuleSoft (Salesforce)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"azure-data-factory","name":"Azure Data Factory","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"celigo","name":"Celigo","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$92M","market_cap":null,"revenue_raw":92000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$33M","revenue_raw":33000000},"2022":{"revenue":"$67M","revenue_raw":67000000},"2024":{"revenue":"$92M","revenue_raw":92000000}}},{"slug":"sap-integration-suite","name":"SAP Integration Suite","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"jitterbit-harmony","name":"Jitterbit Harmony","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"tibco","name":"TIBCO Software","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$1.2B","market_cap":null,"revenue_raw":1200000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$1B","revenue_raw":1000000000},"2024":{"revenue":"$1.2B","revenue_raw":1200000000}}},{"slug":"workato","name":"Workato","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$193M","market_cap":"$5.7B","revenue_raw":193000000,"market_cap_raw":5700000000},"financialsByYear":{"2020":{"revenue":"$50M","revenue_raw":50000000},"2022":{"revenue":"$87M","revenue_raw":87000000},"2024":{"revenue":"$193M","revenue_raw":193000000,"market_cap":"$5.7B","market_cap_raw":5700000000}}},{"slug":"dbt-labs","name":"dbt Labs","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$100M","market_cap":null,"revenue_raw":100000000,"market_cap_raw":null},"financialsByYear":{"2022":{"revenue":"$50M","revenue_raw":50000000,"market_cap":"$4.2B","market_cap_raw":4200000000},"2024":{"revenue":"$100M","revenue_raw":100000000}}},{"slug":"hevo-data","name":"Hevo Data","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"alteryx","name":"Alteryx","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$970M","market_cap":"$3.5B","revenue_raw":970000000,"market_cap_raw":3500000000},"financialsByYear":{"2020":{"revenue":"$495M","revenue_raw":495000000,"market_cap":"$6B","market_cap_raw":6000000000},"2023":{"revenue":"$970M","revenue_raw":970000000,"market_cap":"$3.5B","market_cap_raw":3500000000}}},{"slug":"precisely","name":"Precisely","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"airbyte","name":"Airbyte","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$20M","market_cap":null,"revenue_raw":20000000,"market_cap_raw":null},"financialsByYear":{"2021":{"revenue":"$5M","revenue_raw":5000000,"market_cap":"$1.5B","market_cap_raw":1500000000},"2024":{"revenue":"$20M","revenue_raw":20000000}}},{"slug":"astera-labs","name":"Astera Labs, Inc.","ticker":"ALAB","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$396M","market_cap":"$12B","revenue_raw":396000000,"market_cap_raw":12000000000},"financialsByYear":{"2024":{"revenue":"$396M","revenue_raw":396000000,"market_cap":"$12B","market_cap_raw":12000000000}}},{"slug":"skyvia","name":"Skyvia","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null}]}