{"slug":"pegasystems","name":"Pegasystems","ticker":"PEGA","isPublic":true,"entityType":"company","ownership":"public","parentCompany":null,"parentSlug":null,"financials":{"revenue_2024":"$1.5B","market_cap":"$7B","revenue_raw":1500000000,"market_cap_raw":7000000000},"financialsByYear":{"2015":{"revenue":"$682M","revenue_raw":682000000,"market_cap":"$2B","market_cap_raw":2000000000},"2020":{"revenue":"$1.1B","revenue_raw":1100000000,"market_cap":"$10B","market_cap_raw":10000000000},"2024":{"revenue":"$1.5B","revenue_raw":1500000000,"market_cap":"$7B","market_cap_raw":7000000000}},"years":{"2005":{"query":"Pegasystems competitors 2005","date":"2025-12-24","context":"Pegasystems Inc. is a enterprise software for customer engagement and operations focused on CRM, BPM, case management, and AI-powered decisioning. BPM and CRM software for large enterprises.","sources":["https://www.bpminstitute.org/resources/articles/selection-criteria-bpm-software/","https://www.bpminstitute.org/resources/articles/pick-right-type-bpms-solution/","https://www.techtarget.com/searchcio/definition/Business-process-management-suite-BPMS"],"competitors":[{"name":"IBM (FileNet, WebSphere)","notes":"Major BPM player with FileNet for content-centric workflow and WebSphere for integration. IBM had been providing process automation technology for over two decades by this time."},{"name":"TIBCO (Staffware)","notes":"Provided workflow-oriented BPM solutions through Staffware acquisition. Strong in integration-centric solutions for system-intensive processes."},{"name":"FileNet","notes":"Content-centric workflow-oriented vendor, strong in document-intensive processes. Acquired by IBM in 2006."},{"name":"Documentum (EMC)","notes":"Document-intensive process management and content management competitor."},{"name":"Fuego","notes":"Data-centric workflow-oriented BPM vendor focused on workflow automation."},{"name":"Savvion","notes":"Workflow-oriented BPM vendor providing people-intensive process solutions."},{"name":"Lombardi","notes":"BPM vendor focused on people-intensive processes, later acquired by IBM in 2009."},{"name":"Intalio","notes":"Data-centric workflow-oriented BPM vendor."},{"name":"Metastorm","notes":"BPM vendor for people-intensive processes involving routing, approving and fulfilling requests."},{"name":"Ultimus","notes":"Workflow and BPM solution provider for people-intensive business processes."},{"name":"BEA Systems","notes":"Integration-centric BPM solutions, later acquired by Oracle in 2008."},{"name":"Oracle","notes":"Enterprise software vendor with BPM capabilities, strengthened position through BEA acquisition."},{"name":"Microsoft","notes":"Provided integration-oriented BPM solutions as part of broader enterprise software stack."},{"name":"SAP","notes":"Enterprise software leader with workflow and process management capabilities integrated into ERP systems."}]},"2010":{"query":"Pegasystems competitors 2010","date":"2025-12-24","context":"Pegasystems Inc. is a enterprise software for customer engagement and operations focused on CRM, BPM, case management, and AI-powered decisioning. Decision management and predictive analytics.","sources":["https://www.idevnews.com/images/emailers/110415_ProgressWhitePaper_EU_Kathy/2010-forrester-wave-bpm.pdf","https://camthecisstudent.wordpress.com/2010/01/28/which-bpm-suite-solution-is-right-for-you/","https://www.mordorintelligence.com/industry-reports/business-process-management-market"],"competitors":[{"name":"IBM (WebSphere, Lombardi)","notes":"Forrester Wave Leader in 2010. IBM had been a main BPM provider for over two decades. Acquired Lombardi in December 2009 to combine simplified business-oriented environment with WebSphere Process Server's robust integration platform. Multiple products across WebSphere, Lotus, Tivoli, FileNet and Rational divisions."},{"name":"Appian","notes":"Forrester Wave Leader in 2010 alongside Pegasystems. BPM specialist with 120 customers and 160 employees. Strong in design, development, monitoring and optimization. Focused on government and commercial sectors including retail, manufacturing, financial services, healthcare, and energy."},{"name":"Software AG","notes":"Forrester Wave Leader in 2010 with competitive product offering industry-leading capabilities."},{"name":"Savvion","notes":"Forrester Wave Leader in 2010. Acquired by Progress Software in January 2010."},{"name":"Oracle","notes":"Forrester Strong Performer in 2010. Top 3 BPM vendor globally. Completed acquisition of BEA Systems to broaden BPM portfolio and strengthen integration capabilities."},{"name":"Global 360","notes":"Forrester Strong Performer in 2010 with compelling BPM product."},{"name":"HandySoft (BizFlow)","notes":"Forrester Strong Performer in 2010. Provider of people-intensive process solutions."},{"name":"Fujitsu","notes":"Forrester Strong Performer in 2010 with competitive BPM offering."},{"name":"TIBCO","notes":"BPM+ approach showcasing breadth and depth of functionality. Very strong in highly dynamic processes, goal-based process analytics and process execution."},{"name":"Metastorm","notes":"Continued presence in BPM market with workflow and process management solutions."},{"name":"Lombardi","notes":"Acquired by IBM in December 2009, bringing simplified business-oriented BPM environment."},{"name":"Bizagi","notes":"Emerging BPM vendor gaining traction in the market."},{"name":"K2","notes":"Workflow and BPM platform provider competing in the mid-market."}]},"2015":{"query":"Pegasystems competitors 2015","date":"2025-12-24","context":"Pegasystems Inc. is a enterprise software for customer engagement and operations focused on CRM, BPM, case management, and AI-powered decisioning. Cloud platform growth. Customer engagement focus.","sources":["https://www.slideshare.net/slideshow/forrester-wave-bpm-platforms-for-digital-business-2015/57330713","https://docplayer.net/19366579-The-forrester-wave-bpm-platforms-for-digital-business-q4-2015.html","https://www.gartner.com/en/documents/3899484"],"competitors":[{"name":"Appian","notes":"Forrester Wave Leader in 2015. Pure-play BPM vendor that evolved platform to support wide range of digital business scenarios including mobile engagement, social collaboration, and dynamic case management."},{"name":"IBM","notes":"Forrester Wave Leader in 2015. Evolved BPM offering to cover broad spectrum of use cases for digital operations, including analytics and predefined industry solutions and frameworks. Combined Lombardi acquisition with WebSphere capabilities."},{"name":"Software AG","notes":"Forrester Wave evaluation participant offering competitive BPM platform options."},{"name":"Oracle","notes":"Forrester Wave evaluation participant with enterprise BPM capabilities and broad integration with Oracle technology stack."},{"name":"Bizagi","notes":"Forrester Wave Strong Performer in 2015, strong in enabling rapid development. Later recognized as Leader in Gartner Magic Quadrant for Intelligent BPM Suites."},{"name":"K2","notes":"Forrester Wave Strong Performer in 2015, strong in enabling rapid development and workflow automation."},{"name":"Newgen Software","notes":"Forrester Wave Strong Performer in 2015, strong in enabling rapid development with focus on document-intensive processes."},{"name":"DST Systems","notes":"Forrester Wave Strong Performer in 2015, strong in enabling rapid development."},{"name":"OpenText","notes":"Forrester Wave evaluation participant offering competitive BPM and content management solutions."},{"name":"TIBCO Software","notes":"Forrester Wave evaluation participant, lagged behind leaders but maintained presence in integration-heavy BPM scenarios."},{"name":"Red Hat","notes":"Forrester Wave evaluation participant with open-source BPM approach, lagged behind leaders in 2015 evaluation."},{"name":"Salesforce","notes":"CRM platform with growing process automation and workflow capabilities, competing in customer engagement processes."},{"name":"ServiceNow","notes":"Expanding from IT service management into broader BPM and workflow automation capabilities."},{"name":"bpm'online (later Creatio)","notes":"Vendor combining CRM and BPM capabilities, evaluated in Gartner Magic Quadrant for Intelligent BPM Suites."}]},"2020":{"query":"Pegasystems competitors 2020","date":"2025-12-24","context":"Pegasystems Inc. is a enterprise software for customer engagement and operations focused on CRM, BPM, case management, and AI-powered decisioning. Low-code development. AI-powered automation.","sources":["https://www.flowforma.com/blog/pega-alternatives","https://www.cbinsights.com/company/pegasystems/alternatives-competitors","https://www.zendesk.com/service/comparison/pega-competitors/","https://www.processmaker.com/blog/top-10-appian-alternatives-and-competitors/"],"competitors":[{"name":"Appian","notes":"Direct low-code BPM competitor with strong process management capabilities, AI-assisted orchestration, and real-time data processing. Ideal for enterprises handling sophisticated workflows at scale."},{"name":"ServiceNow","notes":"Expanded from IT service management into business process automation and low-code development. Comprehensive system of record for IT with growing BPM and workflow automation capabilities."},{"name":"Salesforce","notes":"CRM platform leader with Service Cloud offering workflow automation, process automation, chatbots, and collaboration tools. Competing in customer-facing processes and business automation."},{"name":"Microsoft Power Automate","notes":"Low-code automation tool for Microsoft ecosystem, enabling workflow streamlining and process integration. Growing competitor in the low-code BPM space."},{"name":"Mendix (Siemens)","notes":"Full-stack low-code platform for rapid enterprise application development with workflow automation integration. Strong visual development tools for custom solutions."},{"name":"OutSystems","notes":"Leading low-code platform for full-stack application development with high-productivity, connected, and AI-assisted tools for building consumer apps to critical business systems."},{"name":"Bizagi","notes":"Industry-leading low-code process automation platform connecting people, applications, robots, and information. Business-friendly and flexible with strong BPMN compliance."},{"name":"Creatio (formerly bpm'online)","notes":"Low-code platform offering both CRM and BPM solutions for end-to-end process automation and customer engagement. Advanced process modeling with out-of-the-box integrations."},{"name":"IBM BPM","notes":"Enterprise BPM platform with robust process orchestration and monitoring tools, extensive integration capabilities, and detailed process modeling for complex enterprise needs."},{"name":"Camunda","notes":"Flexible open-source BPM solution with strong BPMN compliance, appealing to organizations seeking customizable solutions with minimal entry costs."},{"name":"UiPath","notes":"Major RPA vendor competing with Pega's robotic process automation capabilities. Overlaps with Pega's automation offerings."},{"name":"Automation Anywhere","notes":"RPA platform competing with Pega in robotic process automation space, though Pega offers RPA as part of broader BPM platform."},{"name":"Nintex","notes":"Process automation platform offering workflow automation, RPA, document generation, and process mapping with strong MS365 and Salesforce integration."},{"name":"Zoho Creator","notes":"Low-code application development platform with intuitive interface and short learning curve for building custom business applications."},{"name":"Kissflow","notes":"Easy-to-use low-code platform for custom application development and business process automation with no-code capabilities for business users."}]},"2024":{"query":"Pegasystems competitors 2024","date":"2025-12-24","context":"Pegasystems Inc. is a enterprise software for customer engagement and operations focused on CRM, BPM, case management, and AI-powered decisioning. Pega GenAI and Process AI capabilities.","sources":["https://www.peerspot.com/products/pega-platform-alternatives-and-competitors","https://www.saasworthy.com/product-alternative/38206/pega-platform","https://www.creatio.com/glossary/pega-alternatives","https://www.g2.com/products/pega-platform/competitors/alternatives","https://www.gartner.com/reviews/market/enterprise-low-code-application-platform/vendor/pegasystems/product/pega-platform/alternatives"],"competitors":[{"name":"Appian","notes":"Best overall Pega Platform alternative according to multiple sources. Focuses on data fabric architecture, RPA, and data mining for streamlined BPM. Strong complex data modeling for complicated use cases with out-of-the-box capabilities including document management."},{"name":"ServiceNow","notes":"Major competitor with ServiceNow App Engine for low-code development. Comprehensive business process automation and low-code decentralized development. Strong in IT service management expanding to broader enterprise automation."},{"name":"Salesforce","notes":"CRM platform with Salesforce Flow for process automation. Competing in customer experience, workflow automation, and business process streamlining with integrated Einstein AI capabilities."},{"name":"Microsoft Power Apps","notes":"Low-code platform enabling custom app development without deep coding knowledge. Seamless integration with Microsoft ecosystem (Dynamics, Windows, Microsoft 365) providing advanced CRM capabilities."},{"name":"OutSystems","notes":"Leading low-code platform for full-stack application development. High-productivity, connected, AI-assisted tools for building complete range of applications from consumer apps to critical business systems."},{"name":"Mendix","notes":"Versatile low-code platform for rapid application development with strong focus on collaboration between business users and developers. Supports web and mobile development."},{"name":"Creatio","notes":"No-code platform combining CRM and BPM with powerful BPM engine and composable architecture. Creatio Studio for no-code development with three specialized CRM systems (Sales, Marketing, Service)."},{"name":"Camunda","notes":"Flexible open-source BPM solution with strong BPMN compliance. Appeals to organizations seeking customizable solutions with minimal entry costs versus Pega's high licensing fees."},{"name":"Bizagi","notes":"Industry-leading low-code process automation platform. Business-friendly and flexible, fueled by 1 million users powering 1,000+ organizations including Adidas, BAE Systems, and Old Mutual."},{"name":"Nintex","notes":"Popular Pega alternative offering workflow automation, RPA, document generation, and process mapping. Strong connectors for MS365 and Salesforce integration."},{"name":"IBM BPM","notes":"Enterprise BPM with robust process orchestration and monitoring. Suitable for extensive integration needs and detailed process modeling in large enterprises."},{"name":"Kissflow","notes":"Easy-to-use low-code platform for custom application development. No-code capabilities empower business leaders to automate workflows without programming knowledge."},{"name":"UiPath Agentic Automation","notes":"Leading RPA and intelligent automation platform competing with Pega's automation capabilities. Strong in robotic process automation and AI-powered automation."},{"name":"SS&C Blue Prism","notes":"Intelligent automation platform competing in RPA and process automation space with enterprise-grade security and governance."},{"name":"Zoho Creator","notes":"Affordable low-code platform with intuitive interface for building custom business applications without extensive technical expertise."}]},"2025":{"query":"Pegasystems competitors 2025","date":"2025-12-24","context":"Pegasystems Inc. is a enterprise software for customer engagement and operations focused on CRM, BPM, case management, and AI-powered decisioning. Enterprise AI platform. Competing with Salesforce, ServiceNow.","sources":["https://www.gartner.com/reviews/market/enterprise-low-code-application-platform/vendor/pegasystems/product/pega-platform/alternatives","https://www.peerspot.com/products/pega-platform-alternatives-and-competitors","https://www.creatio.com/glossary/pega-alternatives","https://www.kovaion.com/blog/top-5-pega-alternatives/","https://finance.yahoo.com/news/low-code-platforms-competitive-landscape-120500226.html"],"competitors":[{"name":"Appian","notes":"Top Pega alternative with data fabric architecture, RPA, and data mining capabilities. Strong process orchestration, complex data modeling, out-of-the-box document management, and pre-integrated content management systems."},{"name":"ServiceNow","notes":"Expanded from service management to comprehensive business process automation and low-code development. Strong enterprise adoption with App Engine for decentralized development and workflow automation."},{"name":"Microsoft Power Apps","notes":"Leading low-code platform with massive ecosystem integration across Microsoft 365, Dynamics, and Azure. AI-powered development with Copilot, targeting both professional developers and citizen developers."},{"name":"Salesforce","notes":"CRM leader with expanding low-code capabilities through Salesforce Flow and Lightning Platform. Strong in customer-facing processes with Einstein AI integration for intelligent automation."},{"name":"Mendix (Siemens)","notes":"Full-stack low-code platform included in major 2025 competitive landscape assessments. Strong collaboration between business and IT, supporting rapid enterprise application deployment."},{"name":"OutSystems","notes":"Leading enterprise low-code platform in 2025 competitive assessments. High-productivity full-stack development with AI-assisted tools for mission-critical applications."},{"name":"Creatio","notes":"No-code platform with powerful BPM engine and composable architecture. Combines CRM and BPM with Creatio Studio for development and three specialized industry solutions."},{"name":"Camunda","notes":"Open-source BPM solution with strong BPMN compliance. Flexible and customizable alternative to Pega's proprietary platform with minimal licensing costs."},{"name":"Bizagi","notes":"Business-friendly low-code process automation platform with 1M+ user community. Flexible BPM solution connecting people, applications, robots, and information for 1,000+ organizations globally."},{"name":"Nintex","notes":"Process automation platform with workflow automation, RPA, and document generation. Strong integration with Microsoft 365 and Salesforce ecosystems."},{"name":"Kissflow","notes":"Accessible low-code/no-code platform for business process automation. Empowers business users to automate workflows without programming expertise."},{"name":"Zoho Creator","notes":"Included in November 2025 competitive landscape report. Affordable low-code platform with intuitive interface for custom business applications across skill levels."},{"name":"Oracle","notes":"Enterprise platform vendor included in 2025 low-code competitive assessments. Oracle Integration Cloud and APEX for low-code development within Oracle ecosystem."},{"name":"IBM BPM","notes":"Modernized BPM offering for enterprise process orchestration and monitoring. Extensive integration capabilities for complex enterprise environments."},{"name":"UiPath","notes":"Leading intelligent automation and RPA platform competing with Pega's automation capabilities. Strong AI integration and agentic automation features."}]}},"mentionedBy":[{"slug":"appian","name":"Appian Corporation","ticker":"APPN","year":2000,"notes":"Established BPM vendor with case management and workflow capabilities"},{"slug":"appian","name":"Appian Corporation","ticker":"APPN","year":2005,"notes":"Major BPM vendor with strong modeling, design, and development features for business process management"},{"slug":"appian","name":"Appian Corporation","ticker":"APPN","year":2010,"notes":"Co-leader with Appian in Forrester's 2010 BPM evaluation, strong in modeling and development features"},{"slug":"appian","name":"Appian Corporation","ticker":"APPN","year":2015,"notes":"Advanced case management and decisioning capabilities"},{"slug":"appian","name":"Appian Corporation","ticker":"APPN","year":2024,"notes":"AI-powered decision-making, RPA, and customer engagement"},{"slug":"appian","name":"Appian Corporation","ticker":"APPN","year":2025,"notes":"Enterprise-grade automation platform known for AI-powered decision-making capabilities and robust workflow automation. Designed for large organizations with advanced features including robotic process automation (RPA) and customer engagement tools. One of the top Appian alternatives."},{"slug":"fair-isaac","name":"Fair Isaac Corporation","ticker":"FICO","year":2010,"notes":"Decision management and business process management software company competing with FICO's enterprise software offerings"},{"slug":"fair-isaac","name":"Fair Isaac Corporation","ticker":"FICO","year":2015,"notes":"Primary competitor in decision management software, offering customer engagement and business process automation platforms"},{"slug":"fair-isaac","name":"Fair Isaac Corporation","ticker":"FICO","year":2020,"notes":"Leading competitor in decision management and customer engagement software with AI-powered automation"},{"slug":"fair-isaac","name":"Fair Isaac Corporation","ticker":"FICO","year":2024,"notes":"Leading decision management and customer engagement platform competing in enterprise software and AI-powered decisioning"},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","year":2024,"notes":"Enterprise alternative"},{"slug":"servicenow","name":"ServiceNow Inc.","ticker":"NOW","year":2020,"notes":"Low-code platform with service management and workflow automation"},{"slug":"uipath","name":"UiPath Inc.","ticker":"PATH","year":2010,"notes":"BPM with automation capabilities"},{"slug":"uipath","name":"UiPath Inc.","ticker":"PATH","year":2015,"notes":"BPM with emerging robotic automation capabilities"},{"slug":"uipath","name":"UiPath Inc.","ticker":"PATH","year":2020,"notes":"BPM and low-code platform with RPA capabilities"},{"slug":"uipath","name":"UiPath Inc.","ticker":"PATH","year":2024,"notes":"Offers robotic automation within broader BPM suite, integrated approach for process management and execution"},{"slug":"uipath","name":"UiPath Inc.","ticker":"PATH","year":2025,"notes":"Enterprise-grade RPA solution from Pegasystems, offering robotic automation integrated with case management and business process management capabilities. Suitable for organizations requiring comprehensive process automation."}],"competitors":[{"slug":"ibm-filenet-websphere","name":"IBM (FileNet, WebSphere)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"tibco-staffware","name":"TIBCO (Staffware)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"filenet","name":"FileNet","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"documentum-emc","name":"Documentum (EMC)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"fuego","name":"Fuego","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"savvion","name":"Savvion","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"lombardi","name":"Lombardi","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"intalio","name":"Intalio","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"metastorm","name":"Metastorm","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"ultimus","name":"Ultimus","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"bea","name":"BEA Systems","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$57B","market_cap":"$490B","revenue_raw":57000000000,"market_cap_raw":490000000000},"financialsByYear":{"2000":{"revenue":"$10.1B","revenue_raw":10100000000,"market_cap":"$170B","market_cap_raw":170000000000},"2005":{"revenue":"$11.8B","revenue_raw":11800000000,"market_cap":"$75B","market_cap_raw":75000000000},"2010":{"revenue":"$27B","revenue_raw":27000000000,"market_cap":"$130B","market_cap_raw":130000000000},"2015":{"revenue":"$38B","revenue_raw":38000000000,"market_cap":"$180B","market_cap_raw":180000000000},"2020":{"revenue":"$39B","revenue_raw":39000000000,"market_cap":"$175B","market_cap_raw":175000000000},"2024":{"revenue":"$53B","revenue_raw":53000000000,"market_cap":"$320B","market_cap_raw":320000000000},"2025":{"revenue":"$57B","revenue_raw":57000000000,"market_cap":"$490B","market_cap_raw":490000000000}}},{"slug":"microsoft","name":"Microsoft Corporation","ticker":"MSFT","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$245B","market_cap":"$3.1T","revenue_raw":245000000000,"market_cap_raw":3100000000000},"financialsByYear":{"2000":{"revenue":"$23B","revenue_raw":23000000000,"market_cap":"$550B","market_cap_raw":550000000000},"2005":{"revenue":"$40B","revenue_raw":40000000000,"market_cap":"$280B","market_cap_raw":280000000000},"2010":{"revenue":"$62B","revenue_raw":62000000000,"market_cap":"$240B","market_cap_raw":240000000000},"2015":{"revenue":"$94B","revenue_raw":94000000000,"market_cap":"$400B","market_cap_raw":400000000000},"2020":{"revenue":"$143B","revenue_raw":143000000000,"market_cap":"$1.6T","market_cap_raw":1600000000000},"2024":{"revenue":"$212B","revenue_raw":212000000000,"market_cap":"$2.8T","market_cap_raw":2800000000000},"2025":{"revenue":"$245B","revenue_raw":245000000000,"market_cap":"$3.1T","market_cap_raw":3100000000000}}},{"slug":"sap","name":"SAP","ticker":"SAP","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$34B","market_cap":"$280B","revenue_raw":34000000000,"market_cap_raw":280000000000},"financialsByYear":{"2000":{"revenue":"$6.3B","revenue_raw":6300000000,"market_cap":"$55B","market_cap_raw":55000000000},"2005":{"revenue":"$8.5B","revenue_raw":8500000000,"market_cap":"$50B","market_cap_raw":50000000000},"2010":{"revenue":"$12.5B","revenue_raw":12500000000,"market_cap":"$55B","market_cap_raw":55000000000},"2015":{"revenue":"$21B","revenue_raw":21000000000,"market_cap":"$85B","market_cap_raw":85000000000},"2020":{"revenue":"$28B","revenue_raw":28000000000,"market_cap":"$150B","market_cap_raw":150000000000},"2024":{"revenue":"$34B","revenue_raw":34000000000,"market_cap":"$250B","market_cap_raw":250000000000},"2025":{"revenue":"$34B","revenue_raw":34000000000,"market_cap":"$280B","market_cap_raw":280000000000}}},{"slug":"ibm-websphere-lombardi","name":"IBM (WebSphere, Lombardi)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"appian","name":"Appian Corporation","ticker":"APPN","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$600M","market_cap":"$3B","revenue_raw":600000000,"market_cap_raw":3000000000},"financialsByYear":{"2020":{"revenue":"$304M","revenue_raw":304000000,"market_cap":"$7B","market_cap_raw":7000000000},"2024":{"revenue":"$600M","revenue_raw":600000000,"market_cap":"$3B","market_cap_raw":3000000000}}},{"slug":"ag","name":"Software AG","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"global-360","name":"Global 360","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"handysoft-bizflow","name":"HandySoft (BizFlow)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"fujitsu","name":"Fujitsu","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"tibco","name":"TIBCO Software","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$1.2B","market_cap":null,"revenue_raw":1200000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$1B","revenue_raw":1000000000},"2024":{"revenue":"$1.2B","revenue_raw":1200000000}}},{"slug":"bizagi","name":"Bizagi","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$90M","market_cap":null,"revenue_raw":90000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$50M","revenue_raw":50000000},"2024":{"revenue":"$90M","revenue_raw":90000000}}},{"slug":"k2","name":"K2","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"ibm","name":"IBM Corporation","ticker":"IBM","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$63B","market_cap":"$283B","revenue_raw":63000000000,"market_cap_raw":283000000000},"financialsByYear":{"2000":{"revenue":"$88B","revenue_raw":88000000000,"market_cap":"$208B","market_cap_raw":208000000000},"2005":{"revenue":"$91B","revenue_raw":91000000000,"market_cap":"$130B","market_cap_raw":130000000000},"2010":{"revenue":"$100B","revenue_raw":100000000000,"market_cap":"$180B","market_cap_raw":180000000000},"2015":{"revenue":"$82B","revenue_raw":82000000000,"market_cap":"$140B","market_cap_raw":140000000000},"2020":{"revenue":"$73B","revenue_raw":73000000000,"market_cap":"$110B","market_cap_raw":110000000000},"2024":{"revenue":"$62B","revenue_raw":62000000000,"market_cap":"$170B","market_cap_raw":170000000000},"2025":{"revenue":"$63B","revenue_raw":63000000000,"market_cap":"$283B","market_cap_raw":283000000000}}},{"slug":"newgen","name":"Newgen Software","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"dst","name":"DST Systems","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"opentext","name":"OpenText","ticker":"OTEX","isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$5.77B","market_cap":"$10B","revenue_raw":5770000000,"market_cap_raw":10000000000},"financialsByYear":{"2015":{"revenue":"$1.8B","revenue_raw":1800000000,"market_cap":"$5B","market_cap_raw":5000000000},"2020":{"revenue":"$3.1B","revenue_raw":3100000000,"market_cap":"$10B","market_cap_raw":10000000000},"2024":{"revenue":"$5.77B","revenue_raw":5770000000,"market_cap":"$10B","market_cap_raw":10000000000}}},{"slug":"red-hat","name":"Red Hat","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$38B","market_cap":"$310B","revenue_raw":38000000000,"market_cap_raw":310000000000},"financialsByYear":{"2005":{"revenue":"$310M","revenue_raw":310000000,"market_cap":"$3B","market_cap_raw":3000000000},"2010":{"revenue":"$1.3B","revenue_raw":1300000000,"market_cap":"$8B","market_cap_raw":8000000000},"2015":{"revenue":"$5.4B","revenue_raw":5400000000,"market_cap":"$37B","market_cap_raw":37000000000},"2020":{"revenue":"$17B","revenue_raw":17000000000,"market_cap":"$153B","market_cap_raw":153000000000},"2024":{"revenue":"$35B","revenue_raw":35000000000,"market_cap":"$280B","market_cap_raw":280000000000},"2025":{"revenue":"$38B","revenue_raw":38000000000,"market_cap":"$310B","market_cap_raw":310000000000}}},{"slug":"servicenow","name":"ServiceNow Inc.","ticker":"NOW","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$10.9B","market_cap":"$210B","revenue_raw":10900000000,"market_cap_raw":210000000000},"financialsByYear":{"2015":{"revenue":"$1B","revenue_raw":1000000000,"market_cap":"$15B","market_cap_raw":15000000000},"2020":{"revenue":"$4.5B","revenue_raw":4500000000,"market_cap":"$100B","market_cap_raw":100000000000},"2024":{"revenue":"$10.9B","revenue_raw":10900000000,"market_cap":"$210B","market_cap_raw":210000000000}}},{"slug":"bpm'online-later-creatio","name":"bpm'online (later Creatio)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"mendix-siemens","name":"Mendix (Siemens)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"outsystems","name":"OutSystems","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$332M","market_cap":"$4.3B","revenue_raw":332000000,"market_cap_raw":4300000000},"financialsByYear":{"2021":{"revenue":"$200M","revenue_raw":200000000,"market_cap":"$9.5B","market_cap_raw":9500000000},"2022":{"revenue":"$228M","revenue_raw":228000000,"market_cap":"$4.3B","market_cap_raw":4300000000},"2024":{"revenue":"$332M","revenue_raw":332000000,"market_cap":"$4.3B","market_cap_raw":4300000000}}},{"slug":"creatio-formerly-bpm'online","name":"Creatio (formerly bpm'online)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"ibm-bpm","name":"IBM BPM","ticker":null,"isPublic":false,"entityType":"product","parentSlug":"ibm","financials":null,"financialsByYear":null},{"slug":"camunda","name":"Camunda","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"uipath","name":"UiPath Inc.","ticker":"PATH","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$1.3B","market_cap":"$8B","revenue_raw":1300000000,"market_cap_raw":8000000000},"financialsByYear":{"2021":{"revenue":"$607M","revenue_raw":607000000,"market_cap":"$35B","market_cap_raw":35000000000},"2024":{"revenue":"$1.3B","revenue_raw":1300000000,"market_cap":"$8B","market_cap_raw":8000000000}}},{"slug":"automation-anywhere","name":"Automation Anywhere","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$640M","market_cap":"$3B","revenue_raw":640000000,"market_cap_raw":3000000000},"financialsByYear":{"2020":{"revenue":"$400M","revenue_raw":400000000,"market_cap":"$6.8B","market_cap_raw":6800000000},"2024":{"revenue":"$640M","revenue_raw":640000000,"market_cap":"$3B","market_cap_raw":3000000000}}},{"slug":"nintex","name":"Nintex","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$250M","market_cap":null,"revenue_raw":250000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$150M","revenue_raw":150000000},"2024":{"revenue":"$250M","revenue_raw":250000000}}},{"slug":"zoho-creator","name":"Zoho Creator","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"kissflow","name":"Kissflow","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"mendix","name":"Mendix","ticker":null,"isPublic":false,"entityType":"division","parentSlug":"siemens","financials":{"revenue_2024":"$200M","market_cap":null,"revenue_raw":200000000,"market_cap_raw":null},"financialsByYear":{"2018":{"revenue":"$90M","revenue_raw":90000000,"market_cap":"$730M","market_cap_raw":730000000},"2024":{"revenue":"$200M","revenue_raw":200000000}}},{"slug":"creatio","name":"Creatio","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$200M","market_cap":"$1.2B","revenue_raw":200000000,"market_cap_raw":1200000000},"financialsByYear":{"2023":{"revenue":"$200M","revenue_raw":200000000,"market_cap":"$1.2B","market_cap_raw":1200000000}}},{"slug":"ssc-blue-prism","name":"SS&C Blue Prism","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null}]}