{"slug":"sap","name":"SAP","ticker":"SAP","isPublic":true,"entityType":"company","ownership":"public","parentCompany":null,"parentSlug":null,"financials":{"revenue_2024":"$34B","market_cap":"$280B","revenue_raw":34000000000,"market_cap_raw":280000000000},"financialsByYear":{"2000":{"revenue":"$6.3B","revenue_raw":6300000000,"market_cap":"$55B","market_cap_raw":55000000000},"2005":{"revenue":"$8.5B","revenue_raw":8500000000,"market_cap":"$50B","market_cap_raw":50000000000},"2010":{"revenue":"$12.5B","revenue_raw":12500000000,"market_cap":"$55B","market_cap_raw":55000000000},"2015":{"revenue":"$21B","revenue_raw":21000000000,"market_cap":"$85B","market_cap_raw":85000000000},"2020":{"revenue":"$28B","revenue_raw":28000000000,"market_cap":"$150B","market_cap_raw":150000000000},"2024":{"revenue":"$34B","revenue_raw":34000000000,"market_cap":"$250B","market_cap_raw":250000000000},"2025":{"revenue":"$34B","revenue_raw":34000000000,"market_cap":"$280B","market_cap_raw":280000000000}},"years":{"2000":{"query":"SAP competitors 2000","date":"2025-12-24","context":"SAP SE is a enterprise software company focused on ERP, business applications, and enterprise AI. ERP market leader. R/3 system dominant.","sources":["https://technologyadvice.com/blog/information-technology/top-sap-erp-alternatives/","https://www.cio.com/article/304902/10-most-powerful-erp-vendors-today.html","https://6sense.com/tech/erp/sap-erp-market-share"],"competitors":[{"name":"Oracle","notes":"Primary competitor with Oracle E-Business Suite, competing head-to-head in large enterprise ERP deployments and database-driven applications"},{"name":"PeopleSoft","notes":"Major competitor in HR/HCM and financials, particularly strong in North American enterprise market before Oracle acquisition in 2005"},{"name":"J.D. Edwards","notes":"Mid-market ERP competitor with strong manufacturing and distribution focus, later acquired by PeopleSoft then Oracle"},{"name":"Baan","notes":"European ERP competitor particularly strong in manufacturing sector, offered modular approach competing with SAP R/3"},{"name":"Siebel Systems","notes":"Leading CRM vendor that competed with SAP's expanding customer relationship management offerings"},{"name":"Microsoft","notes":"Growing presence in business applications with Great Plains and Navision acquisitions, targeting SMB market segment"},{"name":"Lawson Software","notes":"Specialized competitor in healthcare and public sector verticals with ERP and HCM solutions"},{"name":"SSA Global","notes":"Mid-market ERP provider with BPCS and other legacy systems competing in manufacturing sector"}]},"2005":{"query":"SAP competitors 2005","date":"2025-12-24","context":"SAP SE is a enterprise software company focused on ERP, business applications, and enterprise AI. NetWeaver platform. Business suite expansion.","sources":["https://6sense.com/tech/erp/sap-erp-market-share","https://www.appsruntheworld.com/top-10-erp-software-vendors-and-market-forecast/","https://www.tdinsights.com/infographics/top-sap-erp-competitors/"],"competitors":[{"name":"Oracle","notes":"Strengthened through major acquisitions of PeopleSoft and J.D. Edwards, consolidating multiple ERP product lines to compete with SAP dominance"},{"name":"Microsoft Dynamics","notes":"Unified business applications brand launched in 2005, combining Great Plains, Navision, Axapta, and Solomon targeting SMB and mid-market"},{"name":"Infor","notes":"Emerged as third-largest ERP vendor through aggressive acquisition strategy, consolidating legacy systems like BPCS, Lawson, and SSA Global"},{"name":"Sage","notes":"Leading SMB-focused accounting and ERP software provider, particularly strong in UK and mid-market segments"},{"name":"Epicor","notes":"Mid-market ERP competitor with strong manufacturing and distribution vertical focus, competing with SAP Business One"},{"name":"NetSuite","notes":"Pioneering cloud-based ERP platform founded in 1998, gaining traction as first true SaaS ERP alternative for growing companies"},{"name":"Workday","notes":"Founded in 2005 by PeopleSoft founders, emerging cloud-native HCM competitor targeting SAP's HR/payroll market"},{"name":"IFS","notes":"Swedish ERP competitor strong in service management, aerospace, and defense sectors with component-based architecture"}]},"2010":{"query":"SAP competitors 2010","date":"2025-12-24","context":"SAP SE is a enterprise software company focused on ERP, business applications, and enterprise AI. HANA in-memory database. Cloud transition beginning.","sources":["https://www.statista.com/statistics/249637/erp-software-market-share-by-company/","https://www.appsruntheworld.com/top-10-erp-software-vendors-and-market-forecast/","https://6sense.com/tech/erp/sap-erp-market-share","https://www.techtarget.com/searcherp/feature/Evaluating-todays-leading-ERP-software-vendors"],"competitors":[{"name":"Oracle","notes":"Second-place ERP vendor with Oracle E-Business Suite and Fusion Applications, combined with database dominance creating integrated competitive offering"},{"name":"Microsoft Dynamics","notes":"Strong competitor in mid-market with Dynamics AX, NAV, GP, and SL products, leveraging Microsoft ecosystem and Office integration"},{"name":"Infor","notes":"Third-largest ERP vendor with extensive portfolio from acquisitions, offering industry-specific solutions competing with SAP verticals"},{"name":"NetSuite","notes":"Leading cloud ERP platform for SMB and mid-market, demonstrating viability of SaaS model before Oracle acquisition in 2016"},{"name":"Workday","notes":"Rapidly growing cloud-native HCM and financial management competitor, disrupting SAP's HR and finance modules with modern UX"},{"name":"Sage","notes":"Leading SMB ERP and accounting software provider with products like Sage 100, 300, 500, and X3 competing below SAP Business One"},{"name":"Epicor","notes":"Mid-market ERP vendor strong in manufacturing, distribution, and retail verticals with industry-tailored solutions"},{"name":"IFS","notes":"Component-based ERP competitor specializing in project-based industries, service management, aerospace, defense, and asset-intensive sectors"},{"name":"Salesforce.com","notes":"Cloud CRM leader expanding into broader enterprise applications, competing with SAP CRM and threatening platform expansion"}]},"2015":{"query":"SAP competitors 2015","date":"2025-12-24","context":"SAP SE is a enterprise software company focused on ERP, business applications, and enterprise AI. S/4HANA next-gen ERP. Cloud growth accelerating.","sources":["https://www.gartner.com/reviews/market/cloud-erp-for-product-centric-enterprises/vendor/sap/alternatives","https://www.gestisoft.com/en/blog/sap-competitors","https://www.openlegacy.com/blog/sap-alternative","https://www.techtarget.com/searchsap/feature/Top-SAP-S-4HANA-alternatives-to-add-to-your-ERP-shortlist"],"competitors":[{"name":"Oracle","notes":"Major competitor with Oracle Fusion Cloud ERP launch and NetSuite acquisition (2016), offering both cloud-native and cloud-enabled solutions"},{"name":"Microsoft Dynamics 365","notes":"Rebranded cloud ERP/CRM suite combining Dynamics AX, NAV, and CRM with Office 365 and Azure integration, strong SMB to enterprise reach"},{"name":"Workday","notes":"Leading cloud HCM and expanding into Workday Financial Management, offering modern cloud-native alternative to SAP's on-premise legacy"},{"name":"NetSuite","notes":"Mature cloud ERP leader for mid-market and SMB segments with 30,000+ customers, comprehensive financial and operational management suite"},{"name":"Infor","notes":"Industry-specific CloudSuite offerings on AWS infrastructure, targeting verticals like manufacturing, healthcare, hospitality, and retail"},{"name":"Salesforce","notes":"Dominant cloud CRM platform expanding into analytics, CPQ, and customer success applications, competing with SAP Customer Experience"},{"name":"Sage","notes":"Cloud transition underway with Sage Intacct (acquired 2017) and Sage X3, targeting SMB financial management and ERP segments"},{"name":"Epicor","notes":"Cloud-enabled ERP solutions for manufacturing and distribution with industry-specific functionality and flexible deployment options"},{"name":"IFS","notes":"Service-centric ERP competitor strong in field service management, enterprise asset management, and project-based industries"},{"name":"Acumatica","notes":"Modern cloud ERP platform with consumption-based pricing model, gaining traction in mid-market with flexible deployment options"}]},"2020":{"query":"SAP competitors 2020","date":"2025-12-24","context":"SAP SE is a enterprise software company focused on ERP, business applications, and enterprise AI. Experience management with Qualtrics. Cloud mandatory.","sources":["https://onfinity.io/blog/uncategorized/who-are-saps-biggest-competitors-in-enterprise-software-for-2025/","https://www.guru99.com/sap-erp-alternative.html","https://www.gestisoft.com/en/blog/sap-competitors","https://dynatechconsultancy.com/blog/saps-top-competitors-and-alternatives"],"competitors":[{"name":"Oracle","notes":"Strong cloud ERP portfolio with Oracle Fusion Cloud ERP for enterprises and NetSuite for mid-market, autonomous database capabilities differentiating"},{"name":"Microsoft Dynamics 365","notes":"Comprehensive cloud ERP and CRM platform with Business Central for SMB and Finance & Operations for enterprise, deep Microsoft ecosystem integration"},{"name":"Workday","notes":"Leading cloud HCM with expanding financial management footprint, strong in large enterprises seeking modern HR and finance cloud solutions"},{"name":"Salesforce","notes":"Cloud platform leader expanding beyond CRM into analytics (Tableau), integration (MuleSoft), and industry clouds competing with SAP Customer Experience"},{"name":"Infor","notes":"Industry-specific CloudSuite solutions on AWS with deep vertical expertise in manufacturing, healthcare, hospitality, and public sector"},{"name":"NetSuite (Oracle)","notes":"Market-leading cloud ERP for growing companies with 30,000+ customers, comprehensive suite for financial, operational, and commerce management"},{"name":"Acumatica","notes":"Cloud-native ERP with flexible deployment and consumption-based licensing, recognized by IDC and growing in mid-market manufacturing and distribution"},{"name":"Sage Intacct","notes":"Cloud financial management platform specializing in automated financial processes for SMB and mid-market, strong multi-entity capabilities"},{"name":"Epicor","notes":"Cloud and hybrid ERP solutions for manufacturing and distribution with customizable industry-specific features and scalability"},{"name":"IFS","notes":"Service and asset management-focused ERP strong in field service, EAM, manufacturing, and project-based industries with composable architecture"},{"name":"ERPNext","notes":"Open-source cloud and on-premise ERP alternative for small and mid-size businesses seeking cost-effective solutions with mobile capabilities"}]},"2024":{"query":"SAP competitors 2024","date":"2025-12-24","context":"SAP SE is a enterprise software company focused on ERP, business applications, and enterprise AI. Business AI integration. S/4HANA Cloud growth.","sources":["https://www.techzine.eu/news/applications/130690/analysis-oracle-beats-sap-in-erp-market/","https://www.appsruntheworld.com/oracle-surpasses-sap-to-become-no-1-erp-apps-provider/","https://www.appsruntheworld.com/top-10-erp-software-vendors-and-market-forecast/","https://thebrandhopper.com/2024/06/15/exploring-sap-top-competitors-and-alternatives/","https://www.statista.com/statistics/249637/erp-software-market-share-by-company/"],"competitors":[{"name":"Oracle","notes":"New market leader with $8.7B ERP revenue and 6.63% share, driven by fast-growing Fusion Cloud ERP for enterprises and NetSuite for SMB/mid-market"},{"name":"Microsoft Dynamics 365","notes":"24.2% market share in ERP category, strong Business Central for SMB and Finance & Operations for enterprise, seamless Microsoft 365/Azure/Teams integration"},{"name":"Workday","notes":"11.38% ERP market share, cloud-native HCM and financial management leader with strong AI-driven analytics and user satisfaction in large enterprises"},{"name":"Intuit","notes":"Third-largest ERP vendor by revenue serving SMB segment with QuickBooks ecosystem and financial management solutions"},{"name":"Constellation Software","notes":"Fourth-largest ERP vendor through acquisition strategy of vertical-specific software companies across diverse industries"},{"name":"Salesforce","notes":"Expanded cloud ecosystem beyond CRM with Tableau analytics, MuleSoft integration, and industry clouds competing in customer experience and data management"},{"name":"Infor","notes":"Industry-specific CloudSuite solutions on AWS infrastructure with deep vertical expertise and modern cloud-native architecture"},{"name":"Acumatica","notes":"IDC MarketScape leader for SaaS mid-market ERP with consumption-based licensing, flexible deployment, and strong customer satisfaction"},{"name":"Epicor","notes":"Customizable and scalable ERP for manufacturing and distribution mid-market, challenging SAP in industry-specific functionality"},{"name":"IFS","notes":"Service and asset management ERP leader excelling in field service, enterprise asset management, and project-based industries"},{"name":"Sage","notes":"SMB and mid-market ERP provider with Sage Intacct cloud financials and X3 for manufacturing/distribution"},{"name":"IQVIA","notes":"Seventh-largest ERP vendor specializing in healthcare and life sciences with industry-specific analytics and operational solutions"}]},"2025":{"query":"SAP competitors 2025","date":"2025-12-24","context":"SAP SE is a enterprise software company focused on ERP, business applications, and enterprise AI. Enterprise AI leader. Cloud ERP competing with Oracle, Workday.","sources":["https://onfinity.io/blog/uncategorized/who-are-saps-biggest-competitors-in-enterprise-software-for-2025/","https://www.gestisoft.com/en/blog/sap-competitors","https://flatlogic-manager.medium.com/best-sap-alternatives-2025-choose-the-right-erp-7901a7f0b312","https://6sense.com/tech/erp/sap-erp-market-share","https://evinciblesolutions.com/us/best-sap-competitors-alternatives"],"competitors":[{"name":"Microsoft Dynamics 365","notes":"Market leader with 24.36% share in ERP category, Business Central at $95/user/month vs SAP's $1,000+, seamless Microsoft 365/Power BI/Teams ecosystem"},{"name":"Workday","notes":"11.08% market share, fully cloud-based HCM and financials with strong AI-driven analytics, 19% growth rate challenging SAP in HR and finance"},{"name":"Oracle NetSuite","notes":"Unified cloud platform disrupting traditional ERP with comprehensive functionality, $999 base + $99/user pricing, strong in e-commerce and multinational compliance"},{"name":"Oracle Fusion Cloud ERP","notes":"Growing 10% with comprehensive SaaS applications, seamless Oracle Cloud/database integration, competing in large enterprise segment"},{"name":"Acumatica","notes":"Cloud-native ERP with flexible deployment and consumption-based pricing, popular with growing SMBs seeking customization without SAP-level consulting fees"},{"name":"Salesforce","notes":"Growing 12% with expanded cloud ecosystem, industry-specific solutions and AI capabilities competing in CRM, analytics, and customer experience"},{"name":"Infor","notes":"Industry-specific CloudSuite solutions with AI/ML capabilities, strong in manufacturing, healthcare, hospitality competing with SAP industry verticals"},{"name":"IFS","notes":"Specialized in service management, field service, and enterprise asset management with composable architecture for asset-intensive industries"},{"name":"Epicor","notes":"Manufacturing and distribution ERP with deep vertical features, cloud and hybrid deployment, faster ROI than SAP for mid-market"},{"name":"Unit4","notes":"Cloud ERP for service-centric organizations, strong in professional services, education, and non-profit sectors with people-centric approach"},{"name":"Sage Intacct","notes":"Cloud financial management for SMB with automated processes and multi-entity capabilities, accessible pricing vs SAP Business One"},{"name":"Odoo","notes":"Open-source ERP with free community version and paid plans from ~$25/user/month, rapidly growing in SMB segment with modular approach"}]}},"mentionedBy":[{"slug":"adobe","name":"Adobe Inc.","ticker":"ADBE","year":2020,"notes":"Enterprise software and cloud solutions competitor"},{"slug":"adobe","name":"Adobe Inc.","ticker":"ADBE","year":2025,"notes":"Enterprise competitor offering integrated solutions that overlap with Adobe's enterprise offerings."},{"slug":"aspen","name":"Aspen Technology Inc.","ticker":"AZPN","year":2024,"notes":"Enterprise resource planning and business process software"},{"slug":"blackline","name":"BlackLine Inc.","ticker":"BL","year":2015,"notes":"Major ERP with financial close capabilities"},{"slug":"blackline","name":"BlackLine Inc.","ticker":"BL","year":2020,"notes":"Enterprise financial management"},{"slug":"blackline","name":"BlackLine Inc.","ticker":"BL","year":2024,"notes":"Major ERP with financial close"},{"slug":"c3ai","name":"C3.ai Inc.","ticker":"AI","year":2015,"notes":"Incorporating AI into enterprise systems"},{"slug":"ceridian-hcm-holding","name":"Ceridian HCM Holding Inc.","ticker":"CDAY","year":2000,"notes":"Enterprise HCM and payroll solutions with global reach"},{"slug":"ceridian-hcm-holding","name":"Ceridian HCM Holding Inc.","ticker":"CDAY","year":2005,"notes":"Enterprise resource planning and HR software provider, strong in large multinational corporations"},{"slug":"ibm","name":"IBM Corporation","ticker":"IBM","year":2010,"notes":"Competitor in enterprise software and business applications"},{"slug":"ibm","name":"IBM Corporation","ticker":"IBM","year":2015,"notes":"Major competitor in enterprise software"},{"slug":"ibm","name":"IBM Corporation","ticker":"IBM","year":2020,"notes":"Enterprise software and applications competitor"},{"slug":"ibm","name":"IBM Corporation","ticker":"IBM","year":2024,"notes":"Enterprise software and AI solutions competitor"},{"slug":"ibm","name":"IBM Corporation","ticker":"IBM","year":2025,"notes":"Enterprise software competitor in ERP and business applications. Note: Also collaborates with IBM as business partner."},{"slug":"manhattan-associates","name":"Manhattan Associates Inc.","ticker":"MANH","year":2000,"notes":"Major ERP and supply chain software provider with warehouse logistics solutions"},{"slug":"manhattan-associates","name":"Manhattan Associates Inc.","ticker":"MANH","year":2005,"notes":"Enterprise software giant with warehouse management and supply chain solutions"},{"slug":"manhattan-associates","name":"Manhattan Associates Inc.","ticker":"MANH","year":2010,"notes":"Market leader with $1.317 billion in 2010 revenue, SAP EWM establishing foothold in automated warehouses"},{"slug":"manhattan-associates","name":"Manhattan Associates Inc.","ticker":"MANH","year":2015,"notes":"Leading enterprise software provider with SAP Supply Chain Management and Ariba"},{"slug":"manhattan-associates","name":"Manhattan Associates Inc.","ticker":"MANH","year":2020,"notes":"SAP Ariba Sourcing (19.18% market share), SAP Supply Chain Management (18.77%), SAP EWM for warehouse management"},{"slug":"manhattan-associates","name":"Manhattan Associates Inc.","ticker":"MANH","year":2024,"notes":"SAP Ariba Sourcing (19.18% share), SAP SCM (18.77% share), SAP Ariba (11.12% share), SAP EWM for warehouse management"},{"slug":"microsoft","name":"Microsoft Corporation","ticker":"MSFT","year":2010,"notes":"Intensely competitive in enterprise software market"},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","year":2005,"notes":"Competitor in applications space"},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","year":2010,"notes":"Ordered to pay Oracle $1.3B for copyright infringement Nov 2010"},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","year":2015,"notes":"ERP leader with S/4HANA and HANA database"},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","year":2020,"notes":"Enterprise software: ERP, CRM, supply chain"},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","year":2024,"notes":"ERP market leader with S/4HANA"},{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","year":2025,"notes":"Major ERP competitor. Primary rival for large enterprise ERP implementations. Direct competition in enterprise applications market."},{"slug":"pegasystems","name":"Pegasystems","ticker":"PEGA","year":2005,"notes":"Enterprise software leader with workflow and process management capabilities integrated into ERP systems."},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","year":2000,"notes":"Enterprise software giant with CRM solutions"},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","year":2005,"notes":"Enterprise CRM solutions"},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","year":2010,"notes":"Enterprise CRM solutions"},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","year":2020,"notes":"Nearest competitor with 5.3% market share as of mid-2020"},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","year":2024,"notes":"Legacy giant fighting to keep ERP customers"},{"slug":"servicenow","name":"ServiceNow Inc.","ticker":"NOW","year":2020,"notes":"Enterprise software giant with service management capabilities"},{"slug":"sps-commerce","name":"SPS Commerce Inc.","ticker":"SPSC","year":2015,"notes":"ERP with integrated supply chain capabilities"},{"slug":"sps-commerce","name":"SPS Commerce Inc.","ticker":"SPSC","year":2024,"notes":"ERP with supply chain including SAP Ariba"},{"slug":"tyler","name":"Tyler Technologies Inc.","ticker":"TYL","year":2000,"notes":"Enterprise ERP with public sector capabilities"},{"slug":"tyler","name":"Tyler Technologies Inc.","ticker":"TYL","year":2005,"notes":"Enterprise ERP software with public sector solutions"},{"slug":"tyler","name":"Tyler Technologies Inc.","ticker":"TYL","year":2010,"notes":"Enterprise ERP with public sector solutions"},{"slug":"tyler","name":"Tyler Technologies Inc.","ticker":"TYL","year":2015,"notes":"Enterprise ERP with public sector solutions"},{"slug":"tyler","name":"Tyler Technologies Inc.","ticker":"TYL","year":2020,"notes":"Enterprise ERP with public sector capabilities"},{"slug":"tyler","name":"Tyler Technologies Inc.","ticker":"TYL","year":2024,"notes":"Enterprise solutions with public sector capabilities"},{"slug":"tyler","name":"Tyler Technologies Inc.","ticker":"TYL","year":2025,"notes":"Enterprise software provider with solutions used by government agencies for financial management and operations."},{"slug":"veeva","name":"Veeva Systems Inc.","ticker":"VEEV","year":2020,"notes":"Enterprise solutions for life sciences regulatory and manufacturing"},{"slug":"veeva","name":"Veeva Systems Inc.","ticker":"VEEV","year":2025,"notes":"Large enterprise software vendor touching various aspects of pharmaceutical operations"},{"slug":"zuora","name":"Zuora Inc.","ticker":"ZUO","year":2010,"notes":"German multinational with ERP and enterprise billing capabilities"}],"competitors":[{"slug":"oracle","name":"Oracle Corporation","ticker":"ORCL","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$57B","market_cap":"$490B","revenue_raw":57000000000,"market_cap_raw":490000000000},"financialsByYear":{"2000":{"revenue":"$10.1B","revenue_raw":10100000000,"market_cap":"$170B","market_cap_raw":170000000000},"2005":{"revenue":"$11.8B","revenue_raw":11800000000,"market_cap":"$75B","market_cap_raw":75000000000},"2010":{"revenue":"$27B","revenue_raw":27000000000,"market_cap":"$130B","market_cap_raw":130000000000},"2015":{"revenue":"$38B","revenue_raw":38000000000,"market_cap":"$180B","market_cap_raw":180000000000},"2020":{"revenue":"$39B","revenue_raw":39000000000,"market_cap":"$175B","market_cap_raw":175000000000},"2024":{"revenue":"$53B","revenue_raw":53000000000,"market_cap":"$320B","market_cap_raw":320000000000},"2025":{"revenue":"$57B","revenue_raw":57000000000,"market_cap":"$490B","market_cap_raw":490000000000}}},{"slug":"peoplesoft","name":"PeopleSoft","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"jd-edwards","name":"J.D. Edwards","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"baan","name":"Baan","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"siebel","name":"Siebel Systems","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"microsoft","name":"Microsoft Corporation","ticker":"MSFT","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$245B","market_cap":"$3.1T","revenue_raw":245000000000,"market_cap_raw":3100000000000},"financialsByYear":{"2000":{"revenue":"$23B","revenue_raw":23000000000,"market_cap":"$550B","market_cap_raw":550000000000},"2005":{"revenue":"$40B","revenue_raw":40000000000,"market_cap":"$280B","market_cap_raw":280000000000},"2010":{"revenue":"$62B","revenue_raw":62000000000,"market_cap":"$240B","market_cap_raw":240000000000},"2015":{"revenue":"$94B","revenue_raw":94000000000,"market_cap":"$400B","market_cap_raw":400000000000},"2020":{"revenue":"$143B","revenue_raw":143000000000,"market_cap":"$1.6T","market_cap_raw":1600000000000},"2024":{"revenue":"$212B","revenue_raw":212000000000,"market_cap":"$2.8T","market_cap_raw":2800000000000},"2025":{"revenue":"$245B","revenue_raw":245000000000,"market_cap":"$3.1T","market_cap_raw":3100000000000}}},{"slug":"lawson","name":"Lawson Software","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$800M","market_cap":"$2B","revenue_raw":800000000,"market_cap_raw":2000000000},"financialsByYear":{"2011":{"revenue":"$800M","revenue_raw":800000000,"market_cap":"$2B","market_cap_raw":2000000000}}},{"slug":"ssa-global","name":"SSA Global","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"infor","name":"Infor","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$3.5B","market_cap":null,"revenue_raw":3500000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$3.2B","revenue_raw":3200000000},"2024":{"revenue":"$3.5B","revenue_raw":3500000000}}},{"slug":"sage","name":"Sage","ticker":"SGE.L","isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$2.9B","market_cap":"$14B","revenue_raw":2900000000,"market_cap_raw":14000000000},"financialsByYear":{"2020":{"revenue":"$2B","revenue_raw":2000000000,"market_cap":"$10B","market_cap_raw":10000000000},"2023":{"revenue":"$2.6B","revenue_raw":2600000000,"market_cap":"$12B","market_cap_raw":12000000000},"2024":{"revenue":"$2.9B","revenue_raw":2900000000,"market_cap":"$14B","market_cap_raw":14000000000}}},{"slug":"epicor","name":"Epicor","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$1.2B","market_cap":null,"revenue_raw":1200000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$900M","revenue_raw":900000000},"2024":{"revenue":"$1.2B","revenue_raw":1200000000}}},{"slug":"netsuite","name":"NetSuite","ticker":null,"isPublic":false,"entityType":"division","parentSlug":"oracle","financials":{"revenue_2024":"$2.8B","market_cap":null,"revenue_raw":2800000000,"market_cap_raw":null},"financialsByYear":{"2015":{"revenue":"$741M","revenue_raw":741000000,"market_cap":"$6B","market_cap_raw":6000000000},"2016":{"revenue":"$970M","revenue_raw":970000000,"market_cap":"$9.3B","market_cap_raw":9300000000},"2023":{"revenue":"$2.8B","revenue_raw":2800000000}}},{"slug":"workday","name":"Workday Inc.","ticker":"WDAY","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$8B","market_cap":"$70B","revenue_raw":8000000000,"market_cap_raw":70000000000},"financialsByYear":{"2015":{"revenue":"$1B","revenue_raw":1000000000,"market_cap":"$16B","market_cap_raw":16000000000},"2020":{"revenue":"$3.6B","revenue_raw":3600000000,"market_cap":"$42B","market_cap_raw":42000000000},"2024":{"revenue":"$7.3B","revenue_raw":7300000000,"market_cap":"$65B","market_cap_raw":65000000000},"2025":{"revenue":"$8B","revenue_raw":8000000000,"market_cap":"$70B","market_cap_raw":70000000000}}},{"slug":"ifs","name":"IFS","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$1.4B","market_cap":null,"revenue_raw":1400000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$650M","revenue_raw":650000000},"2024":{"revenue":"$1.4B","revenue_raw":1400000000}}},{"slug":"salesforce","name":"Salesforce","ticker":"CRM","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$38B","market_cap":"$310B","revenue_raw":38000000000,"market_cap_raw":310000000000},"financialsByYear":{"2005":{"revenue":"$310M","revenue_raw":310000000,"market_cap":"$3B","market_cap_raw":3000000000},"2010":{"revenue":"$1.3B","revenue_raw":1300000000,"market_cap":"$8B","market_cap_raw":8000000000},"2015":{"revenue":"$5.4B","revenue_raw":5400000000,"market_cap":"$37B","market_cap_raw":37000000000},"2020":{"revenue":"$17B","revenue_raw":17000000000,"market_cap":"$153B","market_cap_raw":153000000000},"2024":{"revenue":"$35B","revenue_raw":35000000000,"market_cap":"$280B","market_cap_raw":280000000000},"2025":{"revenue":"$38B","revenue_raw":38000000000,"market_cap":"$310B","market_cap_raw":310000000000}}},{"slug":"acumatica","name":"Acumatica","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$200M","market_cap":"$2B","revenue_raw":200000000,"market_cap_raw":2000000000},"financialsByYear":{"2020":{"revenue":"$60M","revenue_raw":60000000},"2024":{"revenue":"$200M","revenue_raw":200000000,"market_cap":"$2B","market_cap_raw":2000000000}}},{"slug":"netsuite-oracle","name":"NetSuite (Oracle)","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"sage-intacct","name":"Sage Intacct","ticker":null,"isPublic":false,"entityType":"division","parentSlug":"sage","financials":{"revenue_2024":"$480M","market_cap":null,"revenue_raw":480000000,"market_cap_raw":null},"financialsByYear":{"2023":{"revenue":"$400M","revenue_raw":400000000},"2024":{"revenue":"$480M","revenue_raw":480000000}}},{"slug":"erpnext","name":"ERPNext","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"intuit","name":"Intuit Inc.","ticker":"INTU","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$16.3B","market_cap":"$175B","revenue_raw":16300000000,"market_cap_raw":175000000000},"financialsByYear":{"2015":{"revenue":"$4.2B","revenue_raw":4200000000,"market_cap":"$25B","market_cap_raw":25000000000},"2020":{"revenue":"$7.7B","revenue_raw":7700000000,"market_cap":"$80B","market_cap_raw":80000000000},"2024":{"revenue":"$16.3B","revenue_raw":16300000000,"market_cap":"$175B","market_cap_raw":175000000000}}},{"slug":"constellation","name":"Constellation Software","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"iqvia","name":"IQVIA","ticker":"IQV","isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$15.4B","market_cap":"$37.5B","revenue_raw":15400000000,"market_cap_raw":37500000000},"financialsByYear":{"2020":{"revenue":"$11.4B","revenue_raw":11400000000,"market_cap":"$30B","market_cap_raw":30000000000},"2024":{"revenue":"$15.4B","revenue_raw":15400000000,"market_cap":"$37.5B","market_cap_raw":37500000000}}},{"slug":"unit4","name":"Unit4","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"odoo","name":"Odoo","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null}]}