{"slug":"smartsheet","name":"Smartsheet","ticker":"SMAR","isPublic":true,"entityType":"company","ownership":"public","parentCompany":null,"parentSlug":null,"financials":{"revenue_2024":"$950M","market_cap":"$7B","revenue_raw":950000000,"market_cap_raw":7000000000},"financialsByYear":{"2020":{"revenue":"$271M","revenue_raw":271000000,"market_cap":"$5B","market_cap_raw":5000000000},"2024":{"revenue":"$950M","revenue_raw":950000000,"market_cap":"$7B","market_cap_raw":7000000000}},"years":{"2015":{"query":"Smartsheet competitors 2015","date":"2025-12-24","context":"Smartsheet Inc. is a work management platform company focused on project management, collaboration, and workflow automation. Enterprise work management growth.","sources":["https://en.wikipedia.org/wiki/Smartsheet","https://grasshopper.com/resources/tools/project-management-tools-trello-asana-basecamp/","https://www.toptal.com/project-managers/digital/project-management-software","https://openviewpartners.com/blog/evaluating-pricing-differentiation-crowded-market/","https://en.wikipedia.org/wiki/Atlassian"],"competitors":[{"name":"Microsoft Excel","notes":"Microsoft Excel remained the dominant spreadsheet tool for data organization and analysis. While Excel lacked native cloud collaboration features at this time, it was the familiar baseline that Smartsheet sought to extend with project management and real-time collaboration capabilities."},{"name":"Google Sheets","notes":"Google Sheets debuted in 2006 as a free browser-based spreadsheet app with cloud collaboration built in. It offered a more user-friendly and accessible alternative to Excel, though with a limited feature set compared to desktop spreadsheet applications."},{"name":"Microsoft Project","notes":"Microsoft Project was the enterprise standard for project management, offering advanced scheduling, resource management, and Gantt charts. Smartsheet positioned itself as combining some of the functionality of Microsoft Project with the familiarity of Excel."},{"name":"Basecamp","notes":"Basecamp was a popular web-based project management tool focused on task tracking, file sharing, and team communication. In August 2015, Basecamp claimed to have signed more than 5,000 new companies in one week, demonstrating strong market momentum."},{"name":"Asana","notes":"Asana launched in 2008 and was a well-rounded tool for traditional projects of medium complexity. Asana priced on number of members and focused on task and project tracking with an intuitive UI for team collaboration."},{"name":"Trello","notes":"Trello (developed by Atlassian) was a lightweight Kanban-based project management tool that was very easy to set up and use. It was favored by startups, small teams, and temporary projects for its simple, visual board interface."},{"name":"Wrike","notes":"Wrike was a cloud-based project management software that allowed teams to organize their projects online on a single page, enabling team leaders to follow up on projects in real time. It competed directly with Smartsheet in the midweight category."},{"name":"Atlassian Jira","notes":"Jira was Atlassian's project and issue tracking tool, primarily designed for software development teams. It was a heavyweight tool used when elaborate processes and customization were needed, particularly for agile development workflows."},{"name":"Atlassian Confluence","notes":"Confluence was Atlassian's web-based corporate wiki for creating, organizing, and sharing documents and content. It complemented Jira and served as a knowledge management and collaboration platform for teams."},{"name":"SharePoint","notes":"Microsoft SharePoint offered document management, collaboration, and intranet capabilities. Smartsheet combined some of the functionality of SharePoint with Excel and Project to create a unified work management platform."}]},"2020":{"query":"Smartsheet competitors 2020","date":"2025-12-24","context":"Smartsheet Inc. is a work management platform company focused on project management, collaboration, and workflow automation. IPO. Remote work collaboration demand.","sources":["https://www.projectmanager.com/blog/best-smartsheet-alternatives","https://www.constellationr.com/blog-news/insights/smartsheet-vs-asana-vs-monday-what-you-need-know","https://crozdesk.com/compare/asana-vs-smartsheet-vs-monday","https://financesonline.com/comparison-of-wrike-asana-and-trello-top-3-project-management-solutions/","https://en.wikipedia.org/wiki/Atlassian","https://www.proofhub.com/articles/smartsheet-alternatives"],"competitors":[{"name":"Monday.com","notes":"Monday.com emerged as a major competitor, positioning itself as a Work OS that goes beyond traditional project management. It offered highly customizable products with a no-code automation builder and visual, interactive boards. Monday.com was recognized alongside Smartsheet and Asana as a market leader by Gartner."},{"name":"Asana","notes":"Asana continued to be a major competitor with strong reputation for streamlining collaboration. Founded by a Facebook co-founder in 2008, Asana focused on task and project tracking with an intuitive UI. By 2020, Asana was demonstrating solid growth with revenue of $162.5 million, up 20% year-over-year."},{"name":"Wrike","notes":"Wrike positioned itself as one of the most versatile and secure collaborative work management platforms, combining robust functionality with flexibility. It allowed teams to set up workspaces based on their own processes while maintaining structure, visibility, and control for enterprise-level needs."},{"name":"ClickUp","notes":"ClickUp emerged as a cost-effective, all-in-one alternative covering task management, documentation, dashboards, and custom fields. It offered a Free Forever Plan and paid subscriptions beginning at $7/user/month, making it attractive to budget-conscious teams seeking to consolidate multiple tools."},{"name":"Microsoft Project","notes":"Microsoft Project remained a competitor for advanced project scheduling, portfolio management, and resource management. It was particularly strong for managing large teams and complex projects, especially in organizations already using the Microsoft ecosystem."},{"name":"Airtable","notes":"Airtable gained significant market share since its 2012 launch by empowering business users to create data management solutions beyond what was possible in Excel or Google Sheets. It offered relational database flexibility with project management capabilities, ideal for teams needing customizable views and dynamic linking between records."},{"name":"Atlassian Jira","notes":"Jira continued to dominate in software development and IT teams for issue tracking and agile project management. Atlassian completed several acquisitions in 2019-2020 including AgileCraft and Automation for Jira to strengthen its position."},{"name":"Basecamp","notes":"Basecamp remained a popular agile project management and collaboration tool targeted toward small to medium-sized businesses, offering task tracking, file sharing, and team communication in a central hub."},{"name":"Trello","notes":"Trello (owned by Atlassian) continued as a well-known Kanban-based management tool for simple projects with automation and integrations, favored for its simplicity and ease of use."},{"name":"Zoho Projects","notes":"Zoho Projects was a cost-effective alternative with user-friendly interface, Gantt charts, time tracking, and automation features. It was well-suited for employees of different skill levels in small and growing businesses."},{"name":"Google Sheets","notes":"Google Sheets remained a basic competitor for teams needing simple spreadsheet collaboration without advanced project management features, continuing to offer free browser-based access with cloud collaboration."},{"name":"Notion","notes":"Notion emerged as a versatile workspace combining documentation, databases, and project management. It attracted teams looking for an all-in-one knowledge management and collaboration platform."}]},"2024":{"query":"Smartsheet competitors 2024","date":"2025-12-24","context":"Smartsheet Inc. is a work management platform company focused on project management, collaboration, and workflow automation. AI features for project management.","sources":["https://fibery.io/blog/product-management/smartsheet-competitors/","https://www.workzone.com/blog/smartsheet-alternatives/","https://affine.pro/blog/top-advanced-smartsheet-alternatives-project-management-2023","https://management.org/best-smartsheet-alternatives","https://www.techrepublic.com/article/smartsheet-alternatives/","https://bstrategyhub.com/smartsheet-competitors-and-alternatives/","https://www.constellationr.com/blog-news/insights/smartsheet-vs-asana-vs-monday-what-you-need-know"],"competitors":[{"name":"Monday.com","notes":"Monday.com remained a top competitor as a Work OS providing customizable no-code building blocks for shaping workflows. It offered work management, CRM, and development-focused products at a more competitive price point than Smartsheet, with strong visual interfaces and automation capabilities."},{"name":"Asana","notes":"Asana was recognized as the best alternative for managing complex projects with its simple interface and robust management. It offered a free plan supporting teams up to 15 people and was simpler to adopt than Smartsheet, especially for teams not needing deep resource modeling."},{"name":"Wrike","notes":"Wrike was one of the biggest Smartsheet competitors, offering a cloud-based platform with a free plan providing unlimited users, task management, and spreadsheet view. It combined versatility and security with flexibility for enterprise-level project needs."},{"name":"ClickUp","notes":"ClickUp positioned itself as the most cost-effective option with a Free Forever Plan and paid subscriptions at $7/user/month. It offered comprehensive coverage including task management, documentation, dashboards, and custom fields, helping teams consolidate multiple tool subscriptions."},{"name":"Zoho Projects","notes":"Zoho Projects was highlighted as a cost-effective Smartsheet alternative with user-friendly, intuitive interface suitable for employees of different skill levels. It included Gantt charts, time tracking, workflow automation, and strong team collaboration tools."},{"name":"Microsoft Project","notes":"Microsoft Project remained relevant as the Microsoft version of Smartsheet, allowing teams to manage small to large projects with interactive dashboards, dynamic scheduling, automated workflows, and collaboration tools, particularly for organizations in the Microsoft ecosystem."},{"name":"Airtable","notes":"Airtable continued to be Smartsheet's biggest competitor in the relational database and flexible project management space, empowering business users to create sophisticated data management solutions with customizable views and dynamic linking."},{"name":"OpenProject","notes":"OpenProject offered an open source and self-hosted alternative to Smartsheet, providing absolute transparency and high flexibility. It appealed to organizations requiring data sovereignty and customization without vendor lock-in."},{"name":"Basecamp","notes":"Basecamp remained a simpler alternative focused on task tracking and team collaboration for small to medium-sized businesses, though users noted it was not ideal for agile development processes."},{"name":"Scoro","notes":"Scoro was a work management platform helping teams scale faster by accessing crucial project data, with inbuilt CRM, automated billing, resource usage tracking, and revenue forecasting capabilities."},{"name":"Quickbase","notes":"Quickbase emerged as a low-code platform alternative for building custom work management applications, competing in the enterprise space with flexible workflow automation and database capabilities."},{"name":"Workfront","notes":"Workfront (Adobe) positioned itself as an enterprise work management solution for marketing and creative teams, offering robust portfolio and resource management features."},{"name":"Notion","notes":"Notion continued to grow as a versatile all-in-one workspace combining wiki, database, and project management capabilities, appealing to teams seeking integrated knowledge management."},{"name":"Fibery","notes":"Fibery emerged as a work management platform with strong product management focus, offering customizable workflows and connected databases for complex business processes."}]},"2025":{"query":"Smartsheet competitors 2025","date":"2025-12-24","context":"Smartsheet Inc. is a work management platform company focused on project management, collaboration, and workflow automation. Work management platform. Competing with Asana, Monday.com.","sources":["https://www.gartner.com/reviews/market/collaborative-work-management/vendor/smartsheet/product/smartsheet/alternatives","https://www.goodday.work/blog/best-smartsheet-alternatives/","https://www.proofhub.com/articles/smartsheet-alternatives","https://baserow.io/blog/smartsheet-alternatives","https://www.jotform.com/blog/smartsheet-competitors/","https://www.g2.com/products/smartsheet/competitors/alternatives","https://thedigitalprojectmanager.com/tools/best-smartsheet-alternative/","https://tadabase.io/blog/smartsheet-alternatives","https://traffictail.com/smartsheet-competitors/","https://blog.ganttpro.com/en/smartsheet-competitors/"],"competitors":[{"name":"Monday.com","notes":"Monday Work Management is cited as the best overall Smartsheet alternative. It provides a Work OS with customizable no-code building blocks, drag-and-drop functionality, automation, and customizable dashboards. Monday.com offers work management, CRM, and development products with strong visual interfaces."},{"name":"Asana","notes":"Asana is a well-known tool focused on task and project tracking with intuitive UI and strong collaboration features. It suits teams wanting structure without complexity and is simpler to adopt and manage than Smartsheet, especially for teams not needing deep resource modeling or complex spreadsheet-based workflows."},{"name":"Wrike","notes":"Wrike is described as the most versatile and secure collaborative work management platform. It is easy to use yet powerful and flexible enough to meet unique business needs of companies of all sizes and industries, combining robust functionality with the flexibility to set up custom workspaces."},{"name":"ClickUp","notes":"ClickUp is the most cost-effective option with a Free Forever Plan and paid subscriptions at $7/user/month. It covers task management, documentation, dashboards, and custom fields in one platform. Many teams switch from Smartsheet to ClickUp to reduce subscription overhead across specialized tools."},{"name":"Atlassian (Jira/Confluence)","notes":"Atlassian was recognized as a Leader in the 2025 Gartner Magic Quadrant for Collaborative Work Management. Serving over 300,000 customers in 200+ countries, Atlassian offers Jira for project and issue tracking and Confluence for team collaboration and knowledge management."},{"name":"Airtable","notes":"Airtable is Smartsheet's biggest competitor for relational database functionality tied to project data. It is ideal for teams requiring customizable views and dynamic linking between records, empowering business users to create sophisticated data management solutions beyond spreadsheets."},{"name":"Microsoft Project","notes":"Microsoft Project offers advanced project scheduling, portfolio management, and resource management features for large teams and complex projects. It remains a strong alternative especially for organizations already invested in the Microsoft ecosystem."},{"name":"Zoho Projects","notes":"Zoho Projects is a cost-effective alternative with user-friendly, intuitive interface for employees of different skill levels. It offers Gantt charts, time tracking, automation, and strong team collaboration features at competitive pricing."},{"name":"Baserow","notes":"Baserow emerged as an open-source alternative to Smartsheet, offering a no-code database platform with spreadsheet-like interface, API access, and self-hosting options for organizations requiring data sovereignty."},{"name":"GoodDay","notes":"GoodDay is highlighted as a comprehensive work management platform offering project management, product management, and task management in one solution with customizable workflows and real-time collaboration."},{"name":"Workzone","notes":"Workzone offers a great balance of simplicity and robust project management features. Unlike Smartsheet which can be complex, Workzone offers an intuitive interface that's easier to navigate while still providing powerful project tracking capabilities."},{"name":"Toggl Plan","notes":"Toggl Plan provides visual project planning with timeline views and simple drag-and-drop functionality, focusing on ease of use and visual clarity for teams that find Smartsheet too complex."},{"name":"Notion","notes":"Notion continues as an all-in-one workspace combining wiki, database, and project management. It appeals to teams seeking integrated documentation and knowledge management alongside project tracking."},{"name":"Planview","notes":"Planview is an enterprise work management platform providing robust features for digital product development and strategic portfolio management. While more expensive and complex than Smartsheet, it serves enterprise-grade project portfolios and resource management needs."},{"name":"Teamwork.com","notes":"Teamwork.com is cited as a similar app to Smartsheet, offering project management with client collaboration features, time tracking, and resource management capabilities."},{"name":"ProofHub","notes":"ProofHub offers all-in-one project management and team collaboration features with flat pricing model, making it cost-effective for larger teams compared to Smartsheet's per-user pricing."},{"name":"Tadabase","notes":"Tadabase provides a low-code platform for building custom work management applications, competing with Smartsheet's more rigid spreadsheet-based approach by offering greater customization."},{"name":"Visor","notes":"Visor positions itself as a project management timeline tool that integrates with existing data sources, offering Gantt chart visualization and resource management as an alternative to Smartsheet's approach."}]}},"mentionedBy":[{"slug":"asana","name":"Asana","ticker":"ASAN","year":2020,"notes":"Spreadsheet-based work management platform combining familiar Excel-like interface with project management features, Gantt charts, and automation capabilities."},{"slug":"asana","name":"Asana","ticker":"ASAN","year":2024,"notes":"Spreadsheet-based platform offering features Asana lacks including automated update requests, formulas, and time tracking. Strong in resource planning with spreadsheet-style familiarity."},{"slug":"asana","name":"Asana","ticker":"ASAN","year":2025,"notes":"Excel-like platform combining spreadsheet flexibility with advanced project management features including Gantt charts, automation, and collaboration tools. Strong in resource planning and familiar to spreadsheet users."},{"slug":"atlassian","name":"Atlassian Corporation","ticker":"TEAM","year":2024,"notes":"Spreadsheet-based project management platform"},{"slug":"mondaycom","name":"Monday.com","ticker":"MNDY","year":2020,"notes":"Spreadsheet-based project management platform with built-in templates. Appeals to users familiar with Excel/Google Sheets, offering team collaboration tools and workflow automation."},{"slug":"mondaycom","name":"Monday.com","ticker":"MNDY","year":2024,"notes":"Spreadsheet-like interface familiar to Excel users. Main differentiation from Monday.com lies in the classic spreadsheet interface, appealing to teams preferring traditional spreadsheet workflows."},{"slug":"mondaycom","name":"Monday.com","ticker":"MNDY","year":2025,"notes":"Modern work management platform for managing projects, automating processes, and scaling workflows in one central platform. Competes with efficient and highly customizable interface for time management, collaboration, and communication."},{"slug":"procore","name":"Procore Technologies Inc.","ticker":"PCOR","year":2015,"notes":"Flexible construction project management platform"},{"slug":"procore","name":"Procore Technologies Inc.","ticker":"PCOR","year":2024,"notes":"Flexible project management platform"}],"competitors":[{"slug":"microsoft","name":"Microsoft Corporation","ticker":"MSFT","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$245B","market_cap":"$3.1T","revenue_raw":245000000000,"market_cap_raw":3100000000000},"financialsByYear":{"2000":{"revenue":"$23B","revenue_raw":23000000000,"market_cap":"$550B","market_cap_raw":550000000000},"2005":{"revenue":"$40B","revenue_raw":40000000000,"market_cap":"$280B","market_cap_raw":280000000000},"2010":{"revenue":"$62B","revenue_raw":62000000000,"market_cap":"$240B","market_cap_raw":240000000000},"2015":{"revenue":"$94B","revenue_raw":94000000000,"market_cap":"$400B","market_cap_raw":400000000000},"2020":{"revenue":"$143B","revenue_raw":143000000000,"market_cap":"$1.6T","market_cap_raw":1600000000000},"2024":{"revenue":"$212B","revenue_raw":212000000000,"market_cap":"$2.8T","market_cap_raw":2800000000000},"2025":{"revenue":"$245B","revenue_raw":245000000000,"market_cap":"$3.1T","market_cap_raw":3100000000000}}},{"slug":"google-sheets","name":"Google Sheets","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"basecamp","name":"Basecamp","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$100M","market_cap":null,"revenue_raw":100000000,"market_cap_raw":null},"financialsByYear":{"2024":{"revenue":"$100M","revenue_raw":100000000}}},{"slug":"asana","name":"Asana","ticker":"ASAN","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$720M","market_cap":"$4B","revenue_raw":720000000,"market_cap_raw":4000000000},"financialsByYear":{"2021":{"revenue":"$227M","revenue_raw":227000000,"market_cap":"$8B","market_cap_raw":8000000000},"2024":{"revenue":"$720M","revenue_raw":720000000,"market_cap":"$4B","market_cap_raw":4000000000}}},{"slug":"trello","name":"Trello","ticker":null,"isPublic":false,"entityType":"product","parentSlug":"atlassian","financials":null,"financialsByYear":null},{"slug":"wrike","name":"Wrike","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$140M","market_cap":null,"revenue_raw":140000000,"market_cap_raw":null},"financialsByYear":{"2020":{"revenue":"$140M","revenue_raw":140000000}}},{"slug":"atlassian","name":"Atlassian Corporation","ticker":"TEAM","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$4.4B","market_cap":"$43B","revenue_raw":4400000000,"market_cap_raw":43000000000},"financialsByYear":{"2015":{"revenue":"$320M","revenue_raw":320000000,"market_cap":"$4.4B","market_cap_raw":4400000000},"2020":{"revenue":"$1.6B","revenue_raw":1600000000,"market_cap":"$40B","market_cap_raw":40000000000},"2024":{"revenue":"$4.4B","revenue_raw":4400000000,"market_cap":"$43B","market_cap_raw":43000000000}}},{"slug":"sharepoint","name":"SharePoint","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"mondaycom","name":"Monday.com","ticker":"MNDY","isPublic":true,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$972M","market_cap":"$13B","revenue_raw":972000000,"market_cap_raw":13000000000},"financialsByYear":{"2021":{"revenue":"$308M","revenue_raw":308000000,"market_cap":"$12B","market_cap_raw":12000000000},"2024":{"revenue":"$972M","revenue_raw":972000000,"market_cap":"$13B","market_cap_raw":13000000000}}},{"slug":"clickup","name":"ClickUp","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$250M","market_cap":null,"revenue_raw":250000000,"market_cap_raw":null},"financialsByYear":{"2021":{"revenue":"$100M","revenue_raw":100000000,"market_cap":"$4B","market_cap_raw":4000000000},"2024":{"revenue":"$250M","revenue_raw":250000000}}},{"slug":"airtable","name":"Airtable","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$478M","market_cap":"$5B","revenue_raw":478000000,"market_cap_raw":5000000000},"financialsByYear":{"2021":{"revenue":"$156M","revenue_raw":156000000,"market_cap":"$11.7B","market_cap_raw":11700000000},"2023":{"revenue":"$375M","revenue_raw":375000000,"market_cap":"$5B","market_cap_raw":5000000000},"2024":{"revenue":"$478M","revenue_raw":478000000,"market_cap":"$5B","market_cap_raw":5000000000}}},{"slug":"zoho-projects","name":"Zoho Projects","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"notion","name":"Notion","ticker":null,"isPublic":false,"entityType":"company","parentSlug":null,"financials":{"revenue_2024":"$250M","market_cap":"$10B","revenue_raw":250000000,"market_cap_raw":10000000000},"financialsByYear":{"2021":{"revenue":"$100M","revenue_raw":100000000,"market_cap":"$10B","market_cap_raw":10000000000},"2024":{"revenue":"$250M","revenue_raw":250000000,"market_cap":"$10B","market_cap_raw":10000000000}}},{"slug":"openproject","name":"OpenProject","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"scoro","name":"Scoro","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"quickbase","name":"Quickbase","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"workfront","name":"Workfront","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"fibery","name":"Fibery","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"baserow","name":"Baserow","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"goodday","name":"GoodDay","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"workzone","name":"Workzone","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"toggl-plan","name":"Toggl Plan","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"planview","name":"Planview","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"teamworkcom","name":"Teamwork.com","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"proofhub","name":"ProofHub","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"tadabase","name":"Tadabase","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null},{"slug":"visor","name":"Visor","ticker":null,"isPublic":false,"entityType":"unknown","parentSlug":null,"financials":null,"financialsByYear":null}]}